[
    {
        "id": "33",
        "fieldLayoutId": "2",
        "uid": "fbe60d8b-9bfa-4196-bbae-a5df887b8614",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-08-20 17:45:43",
        "dateUpdated": "2018-08-22 21:51:35",
        "siteSettingsId": "33",
        "slug": "sexuality-gender-issues",
        "siteId": "1",
        "uri": "services/sexuality-or-gender-issues",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-08-20 17:45:00",
        "expiryDate": null,
        "contentId": "24",
        "title": "Sexuality or Gender Issues",
        "field_additionalInformation": null,
        "field_body": "<h2>Understanding your sexuality</h2>\n<p>Many people find it extremely hard to recognise why they are attracted to an individual of the same sex or both sexes when it is perceived as 'natural' to be interested in the opposite sex. These feelings are extremely common and there are millions of people all over the world experiencing these emotions. It is normal to feel confused about your emotions and nervous about how others may react. </p>\n<h3>'Coming out'</h3>\n<p>One of the biggest steps is accepting yourself for who you are which can be very difficult for you. Once you have accepted the circumstances and feel more comfortable about it, you may want to tell people about it so they are able to accept you too. This is known as 'coming out' and is usually the hardest part of being gay. When a person chooses to come out it will depend on when they feel it is the right time.</p>\n<p>Everyone is different and from different backgrounds, some people will be very accepting when a person chooses to 'come out' yet others may not. The best person to confide in first is someone close to you that you can trust to keep it to themselvesuntil you are ready to tell others.</p>\n<p>Many individuals who are gay, lesbian or bisexual find the experience very confusing and at times quite lonely. At Castle Counselling Services we can offer you the safe, secure, confidential and non-judgemental space in which to explore any issues you may be experiencing relative to your sexuality or gender identity. Our therapists can offer you the space in which to talk in confidence about the challenges, losses, problems or issues that you may be facing. We will journey with you as you move forward in your own personal exploration.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Sexual orientation indicates whom an individual is sexually and emotionally attracted to. This can mean males or females of the same or opposite sex. A person's sexual orientation is not the same as a person's sexual actions because not everyone expresses the way they are feeling in their actions. It is therefore the feelings one has towards another.</p>",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "2",
        "rgt": "3",
        "level": "1"
    },
    {
        "id": "35",
        "fieldLayoutId": "2",
        "uid": "ce486533-4e89-43ce-9d5d-1080ffe45750",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-08-21 18:55:28",
        "dateUpdated": "2018-08-28 17:58:29",
        "siteSettingsId": "35",
        "slug": "divorce-separation",
        "siteId": "1",
        "uri": "services/divorce-and-separation",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-08-21 18:55:00",
        "expiryDate": null,
        "contentId": "25",
        "title": "Divorce and Separation",
        "field_additionalInformation": null,
        "field_body": "<p>Divorce counselling, also known as separation counselling, gives people the opportunity to examine the relationship with less pressure to ‘fix’ it.. Counselling at this stage also offers you the chance to better understand why the relationship didn't work out.<br /></p>\n<p>The counselling space will also allow you to mourn for the loss of what had once held so much promise. Understanding how to move on is a valuable way to allow individuals to progress with their lives rather than rolling the same issues over into new relationships.</p>\n<p><strong>Counselling can help address issues relating to separation and divorce by:</strong></p>\n<ul><li>Lessen harmful effects on children and partners.</li><li>Helping you make sense of what has happened.</li><li>Assist you in preparing for change and progression.</li><li>Assist in offering you space to gain some perspective and closure.</li></ul><p>Separation counselling will give you a space to talk about your children’s best interests and enable you and your partner to plan ways to deal with the situation.</p>\n<p>At Castle Counselling Services our therapists can offer you the safe and secure space you need to discuss these issues openly, and journey with you during this period of life transition.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Separation and divorce counselling can follow the decision by one or both partners to end a relationship. </p>\n<p>There are a number of reasons why an individual would attend divorce or separation counselling sessions. These may include: </p>\n<ul><li>You are considering separation or divorce</li><li>You may be coping with the feelings associated with separation or divorce</li><li>You may want to discuss and understand fully the effect on children/family members</li></ul>",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "4",
        "rgt": "5",
        "level": "1"
    },
    {
        "id": "37",
        "fieldLayoutId": "2",
        "uid": "3204059a-0386-4cec-8564-822d7ede552c",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-08-21 19:31:17",
        "dateUpdated": "2018-08-22 21:51:35",
        "siteSettingsId": "37",
        "slug": "eating-disorders",
        "siteId": "1",
        "uri": "services/eating-disorders",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-08-21 19:31:00",
        "expiryDate": null,
        "contentId": "26",
        "title": "Eating Disorders",
        "field_additionalInformation": null,
        "field_body": "<p>Eating disorders are serious, yet they are treatable and people can make a full recovery. The journey is long and isn’t easy, but it is possible to get help and fight the fear.</p>\n<p><strong>Types of eating disorders:</strong></p>\n<p>Anorexia nervosa causes a person to feel overweight, even though they may be considerably underweight. The desire to lose weight can lead to the person skipping meals, starving themselves and/or exercising excessively.</p>\n<p>Bulimia can cause a person to feel as though they have lost control in their relationship with food. People with bulimia can fall into a cycle of eating excessively (binge-eating) and purging - through vomiting, over-exercising or using laxatives.</p>\n<p>Binge-eating disorder sees people experiencing a loss of control and overeating regularly. Sometimes described as compulsive eating, a person may rely on food for emotional support or use food as a way to mask difficult feelings. </p>\n<p><strong>Eating disorder not otherwise specified (EDNOS)</strong></p>\n<p>In the past some people with disordered eating may have been diagnosed with EDNOS (eating disorder not otherwise specified). </p>\n<p>However, if you are worried about your own health, or a loved one, there are several warning signs you can look out for, including:</p>\n<ul><li>Skipping meals</li><li>Commenting on their weight, even if they are of a healthy weight/are underweight</li><li>Weighing themselves repeatedly</li><li>Avoiding eating situations, feeling uncomfortable eating in public or making excuses</li><li>Only eating low-calorie foods</li><li>Change in behaviour or personality</li><li>Withdrawing from social situations or hobbies they previously enjoyed</li><li>Using or mentioning ‘pro-anorexia’ websites</li></ul><p>At Castle Counselling Services we can offer you the space and support you may need to consider any eating issues you may have, and we can offer cognitive behavioural techniques tailored to your specific needs. We will also collaboratively work with you to provide you with the support you need to move forward and can also signpost you to other support services within the local area.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Eating disorders are very complex conditions that can affect someone emotionally, physically and socially. Eating disorders are serious mental illnesses; anorexia, binge-eating disorder and bulimia. In the UK, more than 700,000 people are affected by an eating disorder.</p>\n<p>Any person can develop an eating disorder, regardless of age or gender. There is no one reason why you may develop an eating disorder; there could be a range of factors which may include genetic, social, environmental, psychological and biological.</p>",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "6",
        "rgt": "7",
        "level": "1"
    },
    {
        "id": "39",
        "fieldLayoutId": "2",
        "uid": "401fbdba-0d87-4e6a-b1a4-263094760099",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-08-21 19:34:24",
        "dateUpdated": "2018-08-22 21:51:35",
        "siteSettingsId": "39",
        "slug": "emotional-abuse",
        "siteId": "1",
        "uri": "services/emotional-abuse",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-08-21 19:34:00",
        "expiryDate": null,
        "contentId": "27",
        "title": "Emotional Abuse",
        "field_additionalInformation": null,
        "field_body": "<h2>Emotional abuse can fall into three patterns:</h2>\n\n<ul><li>Aggression: which can include name-calling, belittling, blaming, accusing, yelling, screaming, making threats, degrading insults or destructive criticism.</li><li>Denying: this includes sulking, manipulation, neglecting, not listening, withholding affection.</li><li>Minimising: this may include belittling the effect of something, isolating, accusations of exaggerating or inventing and offering solutions or 'advice'.</li></ul><h3>Signs of emotional abuse can be as follows:</h3>\n<ul><li>Depression/anxiety</li><li>Increased isolative behaviours from friends and family</li><li>Fearful or agitated behaviour</li><li>Lower self-esteem/self-confidence</li><li>Reliance on alcohol and drugs</li><li>Escapist behaviour</li></ul><p>Emotional abuse can damage your confidence so that you feel worthless and find it hard to maintain or create other relationships. Secrecy and shame usually maintain this type of abuse, and this can be a very difficult cycle to break without assistance.</p>\n<p>At Castle Counselling Services we can offer you a safe, secure, confidential and non-judgemental space, where you can explore this issue, and it can be the beginning of a long, but rewarding journey to a better and more fulfilling way of living by breaking old, unhealthy patterns. This therapeutic work would be integrative in nature, and would include person-centred/humanistic perspectives, working alongside Cognitive Behavioural Therapy methods of change and also possible exploration of your past relationships through the lens of psychodynamic therapy.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Emotional abuse essentially allows one person to gain power and control over another through words and gestures which gradually undermine the other’s self respect and confidence. Emotional abuse can be difficult to identify, as there is no scars or marks, but the torment can continue indefinitely, and can be a very difficult issue to live with day to day.</p>",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "8",
        "rgt": "9",
        "level": "1"
    },
    {
        "id": "41",
        "fieldLayoutId": "2",
        "uid": "58266bb3-9ce9-4d4e-b8bf-031d565c02c9",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-08-21 19:38:22",
        "dateUpdated": "2018-08-22 21:51:35",
        "siteSettingsId": "41",
        "slug": "family-issues",
        "siteId": "1",
        "uri": "services/family-issues",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-08-21 19:38:00",
        "expiryDate": null,
        "contentId": "28",
        "title": "Family Issues",
        "field_additionalInformation": null,
        "field_body": "<p>A family is a ‘system’, but the rules and expectations of each one are unique and complex and often seen differently by each member of the family. It is through examining what the explicit and hidden ‘rules’ might be in each family and how they are seen and interpreted by each member that therapeutic work might commence. One of the dilemmas of modern family life can undoubtedly be the conflict of being an individual and remaining and existing within the family system.</p>\n<p><strong>Reasons for counselling for family issues may be:</strong></p>\n<ul><li>disruption after separation or divorce or a new partner moving in</li><li>problems with step-family life</li><li>debt</li><li>problems with adolescents or older children</li><li>children leaving home</li><li>unwanted pregnancy</li></ul><p><strong>Therapeutic work may explore:</strong></p>\n<ul><li>exploration of the current problem</li><li>how it is perceived by different members including the client</li><li>ways of dealing with past problems</li><li>parenting issues</li><li>family dynamics and personalities</li><li>communication styles within the family</li><li>how the family functions emotionally</li></ul><p>At Castle Counselling Services we can offer you a safe, secure, confidential and non-judgemental space in which to consider any family issues you may be experiencing. We can assist you in clarifying what the issues are and then focus on solutions. Therapy can help with self-reflection for you, and can increase your self-awareness of your individualised family dynamics. Issues may might be explored may relate to one incident or a repeated pattern of behaviour.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Family life can be a place of refuge and security, but for some it is a source of pain and disappointment. Our families absorb many of the stresses and strains from the outside world – and the pressures can boil over at times, and can have a negative impact on our overall health and well-being.</p>",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "10",
        "rgt": "11",
        "level": "1"
    },
    {
        "id": "43",
        "fieldLayoutId": "2",
        "uid": "adc63923-b0db-4009-a537-f130769ee10f",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-08-21 19:44:16",
        "dateUpdated": "2018-08-22 21:51:35",
        "siteSettingsId": "43",
        "slug": "gambling",
        "siteId": "1",
        "uri": "services/gambling",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-08-21 19:44:00",
        "expiryDate": null,
        "contentId": "29",
        "title": "Gambling",
        "field_additionalInformation": null,
        "field_body": "<p><strong>People who have a gambling addiction may be likely to:</strong></p>\n\n<ul><li>miss work or school in order to spend more time gambling</li><li>lose interest in usual activities or hobbies</li><li>withdraw from social activity</li><li>have arguments with friends or family</li><li>lie about their gambling and attempt to hide it from others</li><li>borrow money, sell possessions or steal in order to gamble</li><li>continue to gamble despite negative outcomes</li><li>suffer frequent mood swings</li></ul><p>Counselling is a particularly successful treatment for gambling addiction. </p>\n<p>At Castle Counselling Services we can offer you a safe, secure, confidential, non-judgemental space to discuss this issue. We can offer you individually tailored Cognitive Behavioural Therapy techniques, which can help you to understand your gambling more and learn new more healthy ways of managing your urge to gamble.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Gambling is an activity where people take part in a game by placing something of monetary value at risk in order to win money or a prize. There are many different forms of gambling – which can include the following: scratch cards, lotteries, bingo, betting on sports or events or playing casino games and arcade machines.<br /></p>\n<p>Gambling addiction is a form of impulse-control disorder where sufferers cannot control their urge to gamble - even when they are aware of the consequences.</p>",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "12",
        "rgt": "13",
        "level": "1"
    },
    {
        "id": "45",
        "fieldLayoutId": "2",
        "uid": "14e53bdd-3ae7-4030-8464-480ebb59a7d2",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-08-21 19:46:46",
        "dateUpdated": "2018-08-22 21:51:35",
        "siteSettingsId": "45",
        "slug": "generalised-anxiety-disorder",
        "siteId": "1",
        "uri": "services/generalised-anxiety-disorder",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-08-21 19:46:00",
        "expiryDate": null,
        "contentId": "30",
        "title": "Generalised Anxiety Disorder",
        "field_additionalInformation": null,
        "field_body": "<p>Generalised anxiety disorder causes both psychological and physical symptoms. The severity of the symptoms experienced will differ from person to person. </p>\n\n\n<p><strong>Psychological symptoms may be:</strong></p>\n<ul><li>a sense of dread</li><li>feeling 'on edge'</li><li>feeling restless inability to relax</li><li>difficulty concentrating</li><li>feeling irritable</li><li>racing thoughts</li><li>intrusive thoughts about worrying scenarios</li></ul><p><strong>Physical symptoms may be:</strong></p>\n<ul><li>feeling lightheaded or dizzy</li><li>feeling lethargic</li><li>heart palpitations</li><li>dry mouth</li><li>muscle aches</li><li>shortness of breath</li><li>tension headaches</li><li>digestive problems</li><li>nausea</li><li>difficulty sleeping/insomnia.</li></ul><p>Not knowing your trigger for anxiety can intensify the feeling and may cause you to feel as if there is no way to stop feeling anxious.</p>\n<p>At Castle Counselling Services we can provide you with one to one counselling in a safe and secure environment, which will provide you with the freedom to be able to explore your anxiety with a counselling professional. This collaborative will be an integrative approach and may include: </p>\n<p>Cognitive behavioural therapy (CBT) this form of therapeutic intervention will assist you understanding how your thoughts, feelings and behaviour affect each other. Having this clarity may assist you to question negative and anxious thoughts, giving you the courage to do things you may ordinarily avoid as they make you anxious.</p>\n<p><strong>Applied relaxation techniques may also be implemented and can include the following:</strong></p>\n<ul><li>Progressive Muscle Relaxation</li><li>Mindfulness Body Scan</li><li>Colour Breathing</li><li>General breathing exercises</li></ul><p>Mindfulness can be particularly beneficial for anxiety, and we are both trained in basic mindfulness techniques to assist you in slowing down and learning to live in the present moment.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Generalised anxiety disorder (also referred to as GAD) is a long-term condition that causes sufferers to feel anxious about a variety of situations/issues, rather than one specific situation. Those experiencing GAD will feel anxious most days and often catastrophize situations Other characteristics of GAD include an inability to focus, loss of concentration and racing thoughts. If you have GAD it may impact your sleeping habits, your relationships or even your ability to hold down a job.</p>",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "14",
        "rgt": "15",
        "level": "1"
    },
    {
        "id": "47",
        "fieldLayoutId": "2",
        "uid": "51da9512-7a39-4c47-bdcc-70dcec7c2e96",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-08-21 19:48:30",
        "dateUpdated": "2018-08-22 21:51:35",
        "siteSettingsId": "47",
        "slug": "gender-dysphoria",
        "siteId": "1",
        "uri": "services/gender-dysphoria",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-08-21 19:48:00",
        "expiryDate": null,
        "contentId": "31",
        "title": "Gender Dysphoria",
        "field_additionalInformation": null,
        "field_body": "<p>Adults who are experiencing gender dysphoria may feel trapped inside a body that doesn't match the gender that they identify with in a general sense.</p>\n\n<p>A person may feel so unhappy about conforming to societal expectations that they live according to their anatomical sex, rather than the gender they feel themselves to be.</p>\n<p>Telling people about your sexuality or gender identity is called ‘coming out’. Coming out is an incredibly individual process. How you come out will depend on you and what you feel comfortable with at that time. </p>\n<p>At Castle Counselling Services we can offer you that safe space to explore your gender and sexuality in a non-judgemental space where you can truly be yourself. If you are experiencing these issues it can be very isolating at times, but we can offer you support to be able to navigate your way forward, and collaboratively consider the best way forward for you as an individual. We can also signpost you to other support services available within Northern Ireland.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Gender dysphoria is where a person may experience discomfort or distress because there may be a mismatch between their biological sex and gender identity, and this is sometimes known as gender incongruence.</p>\n<p>As we know biological sex is assigned at birth, depending on the appearance of the genitals. Gender identity is the gender that a person \"identifies\" with or feels themselves to be. This mismatch between sex and gender identity can lead to distressing and uncomfortable feelings that are called gender dysphoria</p>",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "16",
        "rgt": "17",
        "level": "1"
    },
    {
        "id": "49",
        "fieldLayoutId": "2",
        "uid": "b6cfa44e-38f5-4499-b8f3-cda36990aa99",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-08-21 19:50:29",
        "dateUpdated": "2018-08-22 21:51:35",
        "siteSettingsId": "49",
        "slug": "hoarding",
        "siteId": "1",
        "uri": "services/hoarding",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-08-21 19:50:00",
        "expiryDate": null,
        "contentId": "32",
        "title": "Hoarding",
        "field_additionalInformation": null,
        "field_body": "<p><strong>Hoarding is considered a significant problem if:</strong></p>\n\n<ul><li>the amount of clutter interferes with everyday living – for example, the person is unable to use their kitchen or bathroom and cannot access rooms</li><li>the clutter is causing significant distress or negatively affecting the quality of life of the person or their family – for example, they become upset if someone tries to clear the clutter and their relationship suffers</li></ul><p><strong>Mental health problems associated with hoarding include:</strong></p>\n<ul><li>severe depression</li><li>psychotic disorders, such as Schizoprenia</li><li>OCD – Obsessive Compulsive Disorder</li></ul><p><strong>Someone who has a hoarding disorder may typically display the following:</strong></p>\n<ul><li>keep or collect items that may have little or no monetary value</li><li>find it hard to categorise/organise items</li><li>have difficulties making decisions</li><li>struggle to manage everyday tasks</li><li>become extremely attached to items</li><li>have poor relationships with family or friends</li></ul><p>If you are experiencing these issues, at Castle Counselling Services we can offer you a safe and secure space in which to explore them, and to find a way of moving forward. We can offer CBT methods of change which will assist you in understanding what makes it difficult to throw things away and the reasons why the clutter has built up.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>A hoarding disorder is where someone acquires an excessive number of items and stores them in a chaotic manner, usually resulting in unmanageable amounts of clutter. The items can be of little or no monetary value.</p>",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "18",
        "rgt": "19",
        "level": "1"
    },
    {
        "id": "51",
        "fieldLayoutId": "2",
        "uid": "b4b7f3c8-80f2-44df-aaba-ebd1b3e84262",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-08-21 19:51:10",
        "dateUpdated": "2018-08-22 21:51:35",
        "siteSettingsId": "51",
        "slug": "infertility",
        "siteId": "1",
        "uri": "services/infertility",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-08-21 19:51:00",
        "expiryDate": null,
        "contentId": "33",
        "title": "Infertility",
        "field_additionalInformation": null,
        "field_body": "<p>Infertility can carry with it a sense of denial with sadness and shock, when pregnancy does not materialise. There can also be feelings of fear, guilt and abandonment from the partner who feels the problem lies with them. Women can feel less feminine and men can feel less masculine in the face of infertility. </p>\n\n<p>Infertility can also put stress on your relationship, with studies showing that couples dealing with infertility are more likely to feel unhappy with themselves and their marriages. </p>\n<p>There are some very difficult emotions and feelings which come up including: disappointment, sadness, shame, regret, blame, resentment, grief for a hope not realised etc.</p>\n<p>Infertility can cause and overwhelming strain on a relationship, and for some couples the need for a child become an all consuming focus.</p>\n<p>If couples decide to consider fertility treatment, this too can cause great levels of stress, as you liaise with a number of medical professionals and undergo procedures.</p>\n<p>At Castle Counselling Services we offer you a safe space, where you can explore these emotions without judgement and in an empathic and confidential manner. We would like to use our skills to provide you with a professional who will truly listen to you, and support you in moving forward.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Infertility occurs when a couple cannot conceive despite having regular unprotected sex.</p>\n<p>Around 1 in 7couples experience this issue, and this equates to 3.5 million people in the UK alone.</p>\n<p>This can be an extremely difficult and distressing issue to face as a couple, and can often come as a shock, and can impact on a couple’s hope and dreams for the future.</p>",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "20",
        "rgt": "21",
        "level": "1"
    },
    {
        "id": "53",
        "fieldLayoutId": "2",
        "uid": "ce7b607b-b35f-49ce-adeb-789e9eed8c9d",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-08-21 19:54:01",
        "dateUpdated": "2018-08-22 21:51:35",
        "siteSettingsId": "53",
        "slug": "internet-addiction",
        "siteId": "1",
        "uri": "services/internet-addiction",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-08-21 19:54:00",
        "expiryDate": null,
        "contentId": "34",
        "title": "Internet Addiction",
        "field_additionalInformation": null,
        "field_body": "<p><strong>Cybersex and pornography</strong></p>\n\n\n<p>Though the Internet is often a great way of escaping reality, spending excessive amounts of time on the Internet engaging in cybersex, viewing pornography, spending time in adult chat rooms or carrying out relationships in online fantasy worlds can begin to have negative repercussions on an individuals real life relationships.</p>\n<p><strong>Cyber-relationships</strong></p>\n<p>The Internet is a great way to meet and interact with new people and may even lead to the development of a romantic relationship. However, online relationships are often far more intense than those in reality and there is opportunity to live out our ultimate fantasies. A huge problem with online relationships is that many people online lie about their sex, age, appearance, relationship status and job, meaning that when online friends meet in real-life, unfortunately they may not live up to one another’s online persona resulting in significant emotional distress.</p>\n<p><strong>Online gambling</strong></p>\n<p>Whilst problem gambling has been an issue for a number of years now and there are many associations and support groups offering help and advice, the ease and availability of gambling online has made it more accessible than ever. In addition, recovering gambling addicts may also find it far more difficult not to relapse with the temptation of 24 hour online casinos which are open to anyone of any age. In addition, the financial problems brought on by online gambling can also result in stress, anxiety and depression.</p>\n<p><strong>Gaming addiction</strong></p>\n<p>Many individuals find enjoyment in playing online role playing games in their leisure time, and not everyone who does this is an addict. The vast majority of online gamers are able to strike a balance between gaming, work, friends and family, but unfortunately for some the compulsion to play online games becomes uncontrollable meaning that other areas of real life are neglected.</p>\n<p><strong>Spending addiction</strong></p>\n<p>Online shopping or auction shopping can be just as financially detrimental as online gambling if a habit gets out of control. Shopping addicts have a tendency to purchase things they don't really need and can't really afford but they do so in order to experience the temporary high of placing a winning bid or owning something new.</p>\n<p>There are various symptoms of Internet addiction, and each individual is likely to experience a different set. However, below are some key indicators to be aware of:</p>\n<ul><li>Losing track of time.</li><li>Social isolation</li><li>Temporary high</li><li>Feelings of guilt and defensiveness</li></ul><p>Physical symptoms - Aside from the emotional aspects, excessive computer addiction also causes some physical side effects and discomfort including strained vision, back ache, neck ache, headaches, sleep difficulties, carpal tunnel syndrome and weight gain or loss.</p>\n<p>The ultimate goal of our counselling would be to assist you in either reducing or stopping your addiction all together, depending on your specific needs and goals. Sessions may involve exploring different ways of dealing with certain urges and triggers and exploring the origins of the problem and the underlying reason for your addiction. We may also use cognitive-behavioural therapy, which is a way of changing your thoughts and behaviours surrounding a certain act or issue. We will work with you to help you make sense of your circumstances, to identify your choices for change and to offer support throughout the entire process.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Internet addiction disorder covers a variety of compulsive Internet activities including the following:</p><ul><li>Cybersex and pornography</li><li>Cyber-relationships</li><li>Online gambling</li><li>Gaming addiction</li><li>Spending addiction</li></ul>",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "22",
        "rgt": "23",
        "level": "1"
    },
    {
        "id": "55",
        "fieldLayoutId": "2",
        "uid": "79cf5a5a-597b-4c0b-86b9-474b591a41b9",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-08-21 20:06:58",
        "dateUpdated": "2018-08-22 21:51:35",
        "siteSettingsId": "55",
        "slug": "low-self-esteem",
        "siteId": "1",
        "uri": "services/low-self-esteem",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-08-21 20:06:00",
        "expiryDate": null,
        "contentId": "35",
        "title": "Low Self Esteem",
        "field_additionalInformation": null,
        "field_body": "<p><strong>What causes low self-esteem?</strong></p>\n\n<p>Low self-esteem can often begin in childhood. Teachers, friends, siblings, parents, and even the media send us messages about ourselves, both positive and negative. For some reason, the message that you are not good enough is the one that stays with you, and can become an ingrained core belief that you carry into adulthood.</p>\n<p>Perhaps you found it difficult to live up to other people's expectations of you, or to your own expectations.</p>\n<p>Stress and difficult life events, can also have a negative effect on self-esteem.</p>\n<p>Personality can also play a part. Some people are just more prone to negative thinking, while others set impossibly high standards for themselves.</p>\n<p><strong>Self-esteem is the opinion we hold of ourselves.</strong></p>\n<p>When we have healthy self-esteem, we tend to feel positive about ourselves and about life in general, and this in turn helps us be more able to deal with life's ups and downs.</p>\n<p>When our self-esteem is low, we tend to see ourselves and our life in a more negative and critical light. We also feel less able to take on the challenges life throws at us, and we can become fearful of trying new things.</p>\n<p>If you have low self-esteem or confidence, you may hide yourself away from social situations, stop trying new things and avoid things you find challenging.</p>\n<p>Living with low self-esteem can harm your mental health, leading to problems like depression and anxiety.</p>\n<p>You may also develop unhelpful habits as a means of coping with these feelings.</p>\n<p>At Castle Counselling Services we can offer you a safe, confidential and non-judgemental space in which to explore your self esteem, and consider on a deeper level what life experiences may have contributed to your current difficulties. As professional integrative counsellors we would work collaboratively with you by utilising person-centred concepts, also coupled with the use of Cognitive Behavioural Therapy and Psychodynamic theories to consider the impact of your past.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Self-esteem is the opinion we hold of ourselves.</p>\n<p>When we have healthy self-esteem, we tend to feel positive about ourselves and about life in general, and this in turn helps us be more able to deal with life's ups and downs.</p>\n<p>When our self-esteem is low, we tend to see ourselves and our life in a more negative and critical light. We also feel less able to take on the challenges life throws at us, and we can become fearful of trying new things.</p>",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "24",
        "rgt": "25",
        "level": "1"
    },
    {
        "id": "57",
        "fieldLayoutId": "2",
        "uid": "2fca35d2-2932-4525-a1cf-851dda0702c0",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-08-21 20:07:30",
        "dateUpdated": "2018-08-22 21:51:36",
        "siteSettingsId": "57",
        "slug": "miscarriage",
        "siteId": "1",
        "uri": "services/miscarriage",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-08-21 20:07:00",
        "expiryDate": null,
        "contentId": "36",
        "title": "Miscarriage",
        "field_additionalInformation": null,
        "field_body": "<p>It is normal to be sad when faced with a loss and many women who have suffered a miscarriage spend some time grieving then look forward to life again and planning another pregnancy. Others may find themselves stuck and unable to move forward as grief turns into depression. In this case the sense of loss may be profound and may have triggered some earlier unresolved loss resulting in despair.</p>\n\n<p>Relationships, too, can be affected by loss or guilt or anger which cannot be voiced following such a disappointment. In these cases counselling can help you to understand and process some of the feelings to allow a way forward. Grief in couples can be complex and the pain experienced by each individual can make them feel isolated or abandoned and that the other partner is unavailable to them. Couples counselling can help unravel the tangle of sadness and despair.</p>\n<p>At Castle Counselling Services we can offer you a safe space in which to journey through this difficult transition. Our professional team will offer you a secure holding space in which you can contemplate and grieve fully for your loss, and also offer you support as you navigate your way forward.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Miscarriages are more common than most people imagine with as many as one in every four pregnancies ending this way. Some women may be reluctant to talk about this unhappy experience and wish to put the set-back behind them as quickly as possible, while others need to process the feelings more slowly. For many, the term of the pregnancy and other factors impact on how they feel about what has happened. Some may also need to make certain decisions and manage some practicalities.</p>",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "26",
        "rgt": "27",
        "level": "1"
    },
    {
        "id": "59",
        "fieldLayoutId": "2",
        "uid": "016bd8a8-1fab-495c-9946-15c0c2322ca2",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-08-21 20:08:32",
        "dateUpdated": "2018-08-22 21:51:36",
        "siteSettingsId": "59",
        "slug": "obsessive-compulsive-disorder",
        "siteId": "1",
        "uri": "services/obsessive-compulsive-disorder",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-08-21 20:08:00",
        "expiryDate": null,
        "contentId": "37",
        "title": "Obsessive Compulsive Disorder",
        "field_additionalInformation": null,
        "field_body": "<p><strong>Symptoms of OCD</strong></p>\n\n<p>If you have OCD, you'll usually experience frequent obsessive thoughts and compulsive behaviours.</p>\n<ul><li>An obsession is an unwanted and unpleasant thought, image or urge that repeatedly enters your mind, causing feelings of anxiety, disgust or unease.</li><li>A compulsion is a repetitive behaviour or mental act that you feel you need to carry out to try to temporarily relieve the unpleasant feelings brought on by the obsessive thought.</li></ul><p>At Castle Counselling Services we can offer you a safe space in which to explore your OCD. As integrative counsellors we will work with you in a collaborative manner and may use Cognitive Behavioural Therapy and psychodynamic concept to assist you in moving forward.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Obsessive compulsive disorder (OCD) is a common mental health condition in which a person has obsessive thoughts and compulsive behaviours.</p>",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "28",
        "rgt": "29",
        "level": "1"
    },
    {
        "id": "61",
        "fieldLayoutId": "2",
        "uid": "2b033550-7916-47e1-af0f-e719d0343dff",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-08-21 20:10:02",
        "dateUpdated": "2018-08-22 21:51:36",
        "siteSettingsId": "61",
        "slug": "panic-disorder",
        "siteId": "1",
        "uri": "services/panic-disorder",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-08-21 20:10:00",
        "expiryDate": null,
        "contentId": "38",
        "title": "Panic Disorder",
        "field_additionalInformation": null,
        "field_body": "<p><strong>Panic disorder symptoms</strong></p>\n\n<p>The symptoms of panic disorder can be very distressing and frightening, especially as they are often completely unexpected and develop abruptly. Panic attacks can strike anywhere and at any time. They tend to peak after 10 minutes and last between five and 20 minutes, however in rare cases some last longer. People with panic disorder may have one while they are out shopping, walking down the street, driving their car or even when they are relaxing at home. </p>\n<p>As well as overwhelming feelings of anxiety, panic attack symptoms may also include a combination of the following:</p>\n<ul><li>feeling dizzy, faint or light-headed</li><li>hot or cold flushes</li><li>sweating</li><li>trembling or shaking</li><li>chest pain or discomfort</li><li>heart palpitations</li><li>shortness of breath</li><li>a choking feeling</li><li>fear of dying, losing control or going crazy</li><li>numbness or tingling sensations</li><li>nausea</li><li>dry mouth</li><li>a need to go to the toilet</li><li>ringing in your ears</li><li>a feeling of dread</li><li>shivering.</li></ul><p>At Castle Counselling Services we can offer you a safe, confidential and non-judgemental space in which to explore your anxiety and panic attacks. This may be assisted by our counsellors offering you a combination of Cognitive Behavioural Therapy which will assist you in focusing on the negative thinking patterns and behaviours that may be triggering or sustaining your panic attacks. By helping you to view your fears in a more realistic light, we can assist you in developing new coping skills, which may make it easier to deal with any future panic attacks. We will also offer you individualised relaxation and breathing/mindfulness techniques which you can utilise to assist you in practically dealing with your anxiety/panic on a day to day basis.</p>\n",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Panic disorder is a condition characterised by recurring and regular panic attacks. People who suffer from panic disorder will experience frequent intense surges of terror and anxiety, and these can strike suddenly without warning. In between attacks sufferers may also constantly worry about further attacks and may fret over the symptoms that they trigger, including dizziness, chest pains and heart palpitations.</p>",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "30",
        "rgt": "31",
        "level": "1"
    },
    {
        "id": "63",
        "fieldLayoutId": "2",
        "uid": "f5e31b81-4c1c-47b7-8ef7-69bb88101479",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-08-21 20:11:31",
        "dateUpdated": "2018-08-22 21:51:36",
        "siteSettingsId": "63",
        "slug": "passive-aggressive-behaviour",
        "siteId": "1",
        "uri": "services/passive-aggressive-behaviour",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-08-21 20:11:00",
        "expiryDate": null,
        "contentId": "39",
        "title": "Passive Aggressive Behaviour",
        "field_additionalInformation": null,
        "field_body": "<p>However, because by nature passive aggressive people are unwilling to expose their true feelings, it can be hard to understand the routes of their behaviour. These behaviours often come across instead as:</p>\n\n<ul><li>stubbornness</li><li>contrariness</li><li>bitterness</li><li>closed-mindedness</li><li>unreasonableness</li><li>being difficult</li><li>frustratingly forgetful</li><li>cold</li><li>lazy</li><li>careless</li><li>manipulative</li><li>secretive</li><li>sly.</li></ul><p>There is no 'one way' of dealing with passive aggression because tactics vary from person to person and situation to situation. </p>\n<p>Counselling for passive aggressive behaviour can often be an extremely delicate process, mainly because people who display this form of behaviour do not react well to being ordered to think in a certain way or reveal certain details about themselves. Passive aggressive people may often spend their whole lives denying or repressing their true feelings and opinions, and they will go out of their way to expose the source of authority as ineffective or incompetent.</p>\n<p>At Castle Counselling Services we can offer you a secure, confidential and no-judgemental space in which to explore your own passive aggressive behaviours or help to manage dealing with the passive aggressive behaviour of others. </p>\n<p>The therapeutic work will be done collaboratively and very much client-led. Our integrative approach would be using psychodynamic concepts to explore your past, to see if any past events have triggered your fears and anxieties. Cognitive Behavioural Therapy methods of change can also be used for you to consider how your cognitions in certain events may be adding to your passive aggressive behaviour.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Passive aggressive behaviour is triggered by a desire to please people and may include reasons such as:<br /></p>\n<ul><li>trying to keep the peace</li><li>trying to avoid mistakes</li><li>trying to preserve self-respect</li><li>trying to appear more confident and authoritative</li><li>being unable to express emotions very well</li><li>being afraid of rejection</li><li>being afraid of criticism</li><li>feeling worthless.</li></ul>",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "32",
        "rgt": "33",
        "level": "1"
    },
    {
        "id": "65",
        "fieldLayoutId": "2",
        "uid": "9b936527-fcbe-432c-91fc-41809186ce2b",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-08-21 20:12:38",
        "dateUpdated": "2018-08-22 21:51:36",
        "siteSettingsId": "65",
        "slug": "phobias",
        "siteId": "1",
        "uri": "services/phobias",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-08-21 20:12:00",
        "expiryDate": null,
        "contentId": "40",
        "title": "Phobias",
        "field_additionalInformation": null,
        "field_body": "<p><strong>Symptoms of phobias</strong></p><p>As briefly aforementioned, the symptoms of phobias tend to be very similar to those experienced during a panic attack. These include shortness of breath, heart palpitations, dizziness, trembling and sweating, and in severe cases sufferers may also feel an intense fear of dying and fear of losing control. Due to the varying nature of phobias, not everyone will experience the same symptoms - and while for some the symptoms are mild, others will have full blown attacks. Furthermore, some people with phobias will only have symptoms when they encounter the situation or object that they are afraid of. Others however will feel anxious and panicky just thinking about their phobia. </p>\n\n\n\n<p>At Castle Counselling Services our therapists can offer you the space to consider your phobias in more depth. We may utilise Cognitive Behaviour Therapy as it will allow you to consider your way of processing situations whilst enabling you to find ways to deal with their anxieties more constructively. We may also encourage you to explore some of the complex underlying causes of your anxiety in order to help you better understand, and view in a more realistic light. </p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>What are phobias? </p>\n<p>A phobia is essentially a type of anxiety disorder - a long-term condition where anxiety is experienced on a regular basis and sufferers feel constantly restless, worried and usually unable to sleep and concentrate properly.</p>\n<p>There are several different things that people can develop a phobia of, but there tends to be two distinct categories of phobias. These are both concerned with 'avoidance' which is a complication that often develops from a phobia. </p>",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "34",
        "rgt": "35",
        "level": "1"
    },
    {
        "id": "67",
        "fieldLayoutId": "2",
        "uid": "55389292-244c-4ffb-a054-d5563e3c18b4",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-08-21 20:13:29",
        "dateUpdated": "2018-08-22 21:51:36",
        "siteSettingsId": "67",
        "slug": "post-natal-depression",
        "siteId": "1",
        "uri": "services/post-natal-depression",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-08-21 20:13:00",
        "expiryDate": null,
        "contentId": "41",
        "title": "Post Natal Depression",
        "field_additionalInformation": null,
        "field_body": "<p>With PND, you can experience various symptoms which include feeling low and despondent and feeling that you can't cope with your baby. You may be confused by simple tasks and feel unable to concentrate. You may experience recurring or insistent thoughts that you cannot get out of your mind. As mothers if we feel this way, we may blame ourselves and feel shame and guilt, and may find it difficult to confide in those around us, who expect us to feel happy with our new baby. You may feel very upset or anxious and worry about your health and your baby’s health, or you may feel boredom, indifference or frustration towards your baby. You may wish you had never had your baby. Panic attacks and irritability are also common features of PND. You may also have a poor appetite and problems sleeping in addition to disruption from night feeds. These symptoms can leave you feeling frightened and isolated, and afraid to access help when you really need it.<br /></p>\n<p> Getting Help\u2028\u2028Getting help can be difficult, if you are feeling depressed, but please know that it is ok to ask for and receive help, and what you are experiencing is something that has happened to many other mothers. It can be very common to feel self-critical, that you “should” be able to cope on your own, or to compare yourself unfavourably with other mothers who appear to you to be managing “better”. It can also seem hard and sometimes frightening when you are feeling this way to open up and let others know about it. It is very important though, if you think you are suffering from PND, to get the support you need.</p>\n<p>At Castle Counselling our therapists can offer you that safe, confidential, supportive and non-judgemental space that you need during this difficult transition. You can be fully open about how you are feeling, and we can offer you the understanding and support that you need to move forwards. When you are in the midst of PND things feel like they will never improve, but by having a caring professional to speak to and listen to you, we are hopeful that you will be able to journey through this very difficult time with our therapists by your side.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>PND is different from the “Baby Blues”. “Baby Blues” can affect approximately 80% of women after birth and lasts for a few days. With “Baby Blues” you may feel emotional, burst into tears often and feel irritable or anxious and depressed. If you feel depressed, however, and this lasts for longer than the first two weeks then it is a good idea to seek help. \u2028\u2028</p>\n<p>PND usually begins 2-8 weeks after giving birth, sometimes with no warning, although you may possibly have been experiencing some depression during pregnancy too. </p>",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "36",
        "rgt": "37",
        "level": "1"
    },
    {
        "id": "69",
        "fieldLayoutId": "2",
        "uid": "bfada0f3-6599-4c0e-80f4-b936ec60f005",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-08-21 20:14:32",
        "dateUpdated": "2018-08-22 21:51:36",
        "siteSettingsId": "69",
        "slug": "pregnancy-and-birth",
        "siteId": "1",
        "uri": "services/pregnancy-and-birth",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-08-21 20:14:00",
        "expiryDate": null,
        "contentId": "42",
        "title": "Pregnancy and Birth",
        "field_additionalInformation": null,
        "field_body": "<p>Feeling anxious about your baby's health, the birth and your ability as a parent are all perfectly natural. If these feelings begin to get in the way of your happiness however, it may be time to take action.</p>\n\n<p><strong>Common symptoms of anxiety include:</strong></p>\n<ul><li>Feeling on-edge all the</li><li>Anxiety/panic attacks</li><li>Avoiding people/situations</li><li>Difficulty concentrating</li><li>Anxiety, stress and depression often go hand in hand, with one leading to another if not treated.</li><li>Anxiety towards the birth</li></ul><p>Giving birth is no longer an act shrouded in mystery - thanks to TV shows like One Born Every Minute we can watch the birthing experience in its entirety. For some this is helpful, for others it only confirms fears of complications</p>\n<p>Of course, if you are pregnant with your first child it is normal to have some anxiety about the birth. It is something you will have never experienced before and understandably you will be unsure of what to expect. Even if you have had children before, worrying about things going wrong in the delivery room is still common. This could be due to previous experiences, friends’ experiences or reading about long, painful births in the media. Whatever your reasons may be, for some the thought of giving birth becomes almost a phobia.</p>\n<p>To cope with this type of anxiety it is recommended that you arm yourself with information. Speak to a medical professional with experience, they will be able to tell you about possible complications, how likely it is that they will happen and exactly what the midwife/doctors will do in that situation.</p>\n<p>The important thing to remember is that every birth is different and just because your friend/cousin/sister had a difficult labour, it doesn’t mean you will too.</p>\n<p>Try to learn some relaxation techniques such as deep breathing to control your anxiety. Reaching out about your fears before your due date will give you time to trace your concerns, gain information and develop a coping strategy before the birth. </p>\n<p><strong>Coping with a traumatic birth</strong></p>\n<p>For the majority of people childbirth is an extraordinary event, for others it can feel traumatic due to complications during labour, or unexpected deviations from the birthing plan. Sometimes even when everything goes according to plan, the experience can be such an overwhelming one that mothers are left feeling traumatised.</p>\n<p>Coping with this can be difficult and may require the help of a therapist who can talk through these feelings. Being fully informed about exactly what happened is key to dealing with the event - for many mothers their emotions and feelings run so high during labour that memories of the birth get skewed. Getting a detailed account of the labour from your midwife or doctor can help you put things into perspective.</p>\n<p>At Castle Counselling Services we can offer you the safe space you need to explore your concerns. If you have experienced a traumatic birth, our counsellors can work with you to Speaking to explain some of the panic-based reactions and over time hopefully to work towards desensitising your trauma.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>When you discover you are pregnant, a certain degree of stress and anxiety is to be expected - whether the pregnancy was planned or unplanned, the implications of a positive pregnancy test can be overwhelming.<br /></p>\n<p>While this is a normal experience for many, there can be times when these feelings build up to such a level that they cause antenatal depression and other mental health issues.</p>\n<p>You may feel as though now is the time to prove yourself as a 'multitasking hero', but in reality this is the time when you need support the most. Getting support and developing coping mechanisms can help transform a time of stress and anxiety into one of excitement and joy. For some an unwanted pregnancy or unexpected miscarriage can create considerable distress</p>",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "38",
        "rgt": "39",
        "level": "1"
    },
    {
        "id": "71",
        "fieldLayoutId": "2",
        "uid": "7bdbcef1-1b87-4700-98f5-ca1e82f7b550",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-08-21 20:16:32",
        "dateUpdated": "2018-08-22 21:51:36",
        "siteSettingsId": "71",
        "slug": "redundancy",
        "siteId": "1",
        "uri": "services/redundancy",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-08-21 20:16:00",
        "expiryDate": null,
        "contentId": "43",
        "title": "Redundancy",
        "field_additionalInformation": null,
        "field_body": "<p>The toughest thing for some people is feeling as if they have no purpose, and staying positive within a routine. Staying in the office mentality by ensuring you are at your computer looking for work at 9am every morning can prove helpful. Set yourself tasks for later in the day and do keep in contact with friends and ex-colleagues, it is important to keep a balance.</p>\n\n<p>At Castle Counselling Services we can offer you a safe, secure, confidential, non-judgemental space in which to consider the impact of your redundancy on a number of levels, and also how you may wish to move forward. This can be a stressful time for you, but our fully trained therapists can offer you the supportive space to talk about how you are feeling, and assist you in finding your way forward.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>The dictionary defines redundancy as the state of being no longer needed or useful, and whether that description applies to machinery or human beings - the implications can be gloomy. Looking at this definition and the negative connotations with which it often comes can help us to understand and explore why it can have such devastating effects for some. On the flip side however, redundancy does not have to be limiting. It can be a positive, life-changing event for those who are able to work through the set-backs and find a new way forward.</p>",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "40",
        "rgt": "41",
        "level": "1"
    },
    {
        "id": "73",
        "fieldLayoutId": "2",
        "uid": "ee5a6e96-5228-4ca4-9b99-44cad5838dc9",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-08-21 20:17:15",
        "dateUpdated": "2018-08-22 21:51:36",
        "siteSettingsId": "73",
        "slug": "relationship-issues",
        "siteId": "1",
        "uri": "services/relationship-issues",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-08-21 20:17:00",
        "expiryDate": null,
        "contentId": "44",
        "title": "Relationship Issues",
        "field_additionalInformation": null,
        "field_body": "<p>In some cases, our relationships may not be meeting our expectations, which can, in turn, impact our happiness and life satisfaction. Relationships can be very one-sided and if the two people are not seen as equals, problems can occur. For others, they may crave companionship yet find them very difficult to come by.</p>\n<p>Whatever the relationship issue, at Castle Counselling Service we can support you, whether as a couple or an individual – providing you with the space so you can talk about your concerns and your needs, and explore what you want from your relationships. By speaking to our counsellors we hope you can learn more about yourself while also receiving the support and guidance you may need to get back on track.</p>\n<p>Counselling can also offer you the opportunity to explore your past and current experiences of being close to others, and what this really means for you, whilst working to strengthen your own sense of self. Counselling can assist you in leading you towards a greater sense of self, not only in your own life, but in your relationships with others.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Relationships are a very meaningful part of our lives and can bring us a great deal of happiness and fulfilment. Strong connections with our loved ones, friends and work colleagues allow us to be at our healthiest and most productive, and for many, these relationships offer an important source of advice, guidance, love and support.<br /></p>\n<p>However, fulfilling and supportive relationships don’t come automatically. They require good social skills and a great deal of work, time and energy to stay strong and go the distance. Sometimes our most meaningful connections break down, for whatever reason, leaving us feeling lonely, disappointed and unsure of ourselves.<br /></p>\n",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "42",
        "rgt": "43",
        "level": "1"
    },
    {
        "id": "75",
        "fieldLayoutId": "2",
        "uid": "3e104ed7-4074-429f-9458-25bf43742557",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-08-21 20:19:19",
        "dateUpdated": "2018-08-22 21:51:36",
        "siteSettingsId": "75",
        "slug": "sad",
        "siteId": "1",
        "uri": "services/sad",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-08-21 20:19:00",
        "expiryDate": null,
        "contentId": "45",
        "title": "Sad",
        "field_additionalInformation": null,
        "field_body": null,
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Seasonal affective disorder (SAD) is a form of depression that people experience at a particular time of year or during a particular season. It is a recognised mental health disorder.<br /></p>\n<p>Most of us are affected by the change in seasons – it is normal to feel more cheerful and energetic when the sun is shining and the days are longer, or to find that you eat more or sleep longer in winter.</p>\n<p>However, if you experience SAD, the change in seasons will have a much greater effect on your mood and energy levels, and lead to symptoms of depression that may have a significant impact on your day-to-day life.</p>\n<p>SAD has many different symptoms. You do not need all of them to be experiencing SAD:</p>\n<ul><li>lack of energy for everyday tasks, such as studying or going to work</li><li>concentration problems</li><li>sleeping issues - such as sleeping for longer than usual or not being able to get to sleep</li><li>depression – feeling sad, low, tearful, guilty, like you have let others or yourself down; sometimes feeling hopeless and despairing, sometimes apathetic and feeling nothing</li><li>anxiety – tenseness and inability to cope with everyday stresses</li><li>panic attacks</li><li>mood changes – in some people, bursts of hyperactivity and cheerfulness in spring and autumn</li><li>overeating – particularly 'comfort eating' or snacking more than usual</li><li>being more prone to illness – some people with SAD may have a lowered immune system during the winter, and may be more likely to get colds, infections and other illnesses</li><li>loss of interest in sex or physical contact</li><li>social and relationship problems – irritability or not wanting to see people; difficult or abusive behaviour</li><li>greater drug or alcohol use</li></ul><p>At Castle Counselling Services we can offer you a safe, secure and confidential space in order to explore your seasonal affective disorder (SAD). Counselling with one of our therapists can help you to recognise and deal with factors which may be contributing to your symptoms. </p>\n<p>They can also help you recognise and deal with other factors that may be contributing to your symptoms.</p>",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "44",
        "rgt": "45",
        "level": "1"
    },
    {
        "id": "77",
        "fieldLayoutId": "2",
        "uid": "26312d26-59c6-4aaa-bc61-19eea7081b78",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-08-21 20:20:31",
        "dateUpdated": "2018-08-22 21:51:36",
        "siteSettingsId": "77",
        "slug": "self-harm",
        "siteId": "1",
        "uri": "services/self-harm",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-08-21 20:20:00",
        "expiryDate": null,
        "contentId": "46",
        "title": "Self-Harm",
        "field_additionalInformation": null,
        "field_body": "<p>For some, there is a particular event or experience that triggers them to start hurting themselves. These may include: </p>\n<ul><li>being bullied</li><li>feeling overwhelmed with school work</li><li>losing a loved one</li><li>the end of a relationship</li><li>losing a job</li><li>having an illness (mental or physical)</li><li>feeling stressed</li><li>having a poor sense of self-worth</li><li>feeling confused about sexuality</li><li>experiencing abuse (sexual, physical or emotional)</li><li>having difficulties at home</li></ul><p>For others, there seems to be no direct cause. If you self-harm but don’t know why, you are not alone and you can still reach out for support.</p>\n<p>There may be certain situations or times that make self-harm more likely, for example after drinking alcohol or at night time. Every person experiences self-harm differently and one person’s reasons will be different to another person’s. </p>\n<p>At Castle Counselling Services we can offer you a safe, secure, confidential and non-judgemental space that will enable you to explore your self-harm. This space will allow you to talk about your feelings in depth. As integrative counsellors our practitioners may use psychodynamic therapy concepts and cognitive behavioural therapy methods of change to assist you in progressing forward and breaking this cycle of self-harm.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Self-harm is when someone hurts themselves on purpose, usually as a way of coping with difficult emotions. It often begins when a person feels overwhelmed with upsetting thoughts and feelings. Harming themselves physically can feel like a release, almost giving them a sense of relief from the emotional pain they’re feeling.<br /></p>\n<p>This relief is only temporary though and is often followed by feelings of guilt and even shame. As the emotional pain is still present, the person may continue to rely on self-harming in an attempt to cope, continuing the cycle.<br /></p>\n",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "46",
        "rgt": "47",
        "level": "1"
    },
    {
        "id": "79",
        "fieldLayoutId": "2",
        "uid": "937e31d9-9f65-498f-b0ba-d01981c64b90",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-08-21 20:26:47",
        "dateUpdated": "2018-08-22 21:51:36",
        "siteSettingsId": "79",
        "slug": "trauma",
        "siteId": "1",
        "uri": "services/trauma",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-08-21 20:26:00",
        "expiryDate": null,
        "contentId": "47",
        "title": "Trauma",
        "field_additionalInformation": null,
        "field_body": "<p>Insofar as we adopt this wide ranging definition trauma is the stuff of everyday life.</p><p><strong>Types of trauma:</strong></p>\n\n<ul><li>Developmental Trauma</li><li>PTSD</li><li>Sexual assault</li><li>Child neglect/physical and sexual abuse</li><li>Domestic violence</li><li>War/conflict trauma</li><li>Violence experienced in the community or school</li><li>Medical trauma</li><li>Birth trauma</li><li>Emotional abuse</li><li>Psychological maltreatment</li><li>Traumatic loss</li></ul><p>Possible symptoms experienced when you have experienced a traumatic event:</p>\n<ul><li>feeling on edge – on the lookout for danger, worrying that something may happen</li><li>being jumpy – easily startled by loud noises, sudden movements, etc </li><li>difficulty sleeping – difficulty in getting off to sleep, waking up during the night, having vivid dreams or nightmares</li><li>intrusive memories – thoughts or images of the traumatic event ‘come out of the blue’, or are triggered by sounds, smells, or sights that somehow bring it all back</li><li>feeling as if it were happening again – this may feel as if the traumatic events are recurring all over again</li><li>feeling overwhelmed - by intense feelings and bodily sensations that you feel you cannot handle</li><li>guilt and shame – feelings about letting yourself or others down, about being in some way responsible, or because you survived when others didn’t</li><li>anxiety – feelings of fearfulness, nervousness and sometimes panic</li><li>sadness – feelings of low mood and tearfulness</li><li>anger – at the injustice or the person who is responsible </li><li>emotional numbness – feeling detached and unable to have feelings</li><li>withdrawal – retreating into yourself, avoiding company</li><li>disappointment – thinking that other people (including family) do not understand</li><li>mental avoidance – of thoughts and memories associated with the event</li><li>behavioural avoidance – of activities, places, people and situations which remind you of the incident</li><li>physical reactions – such as feeling shaky, trembling, muscular aches, tiredness, difficulty concentrating, being forgetful, palpitations, shallow rapid breathing, dizziness, stomach upset, nausea, vomiting and diarrhoea, disturbance of menstrual cycle or loss of interest in sex</li><li>impact on relationships – the experience of trauma and bereavement can however sometimes place strains on relationships. You may feel that too little, or the wrong sort of help and support is offered, or that others do not appreciate what you have been through and expect too much of you</li><li>drink and drugs – sometimes, there is a tendency for people to rely on drink or drugs as a means of coping</li><li>loss of confidence and self esteem – feeling that nothing you do is good enough</li><li>feelings of irritability, frustration, and anger – if things do not work out as you want</li></ul><p>At Castle Counselling Services we can offer you a safe, secure, confidential and non-judgemental space in which to explore your trauma in more depth. This will be done very gently and will be very much led by yourself as client. As integrative counsellors our therapist may utilise the following concepts in your sessions:</p>\n<p>Cognitive Behavioural Therapy techniques – the focus of these concepts will be relative to the identification of your cognitions and how these may be modifying your behaviour in various situations. There will also be identification of shattered beliefs and rebuilding these through cognitive restructuring, which in turn may assist you in developing new meanings from your traumatic experiences. </p>\n<p>Behavioural experimentation and graded exposure – Avoidance of certain situations can be very common in individuals who have experienced trauma. Behavioural experimentation and exposure may be considered if avoidance is becoming something that is holding you back.</p>\n<p>Trauma and the body - trauma can live on in our bodies long after the events, and our natural body responses can be one of fight, flight, freeze or flop. Consideration of how the trauma may still be present in a sensorimotor sense can be very beneficial in assisting you in moving on by recognising how your body responds to trauma and how this can be expelled. </p>\n<p>Creative techniques – creative/art therapy techniques can be used to good effect to assist you in progressing through your trauma without having to relive it and can assist in avoiding re-traumatisation.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>The dictionary defines trauma as “a deeply distressing or disturbing experience”. Defined like that the events which can be considered traumatic are wide ranging indeed - from what might be considered the stuff of ordinary life such as divorce, illness, accidents and bereavement to extreme experiences of war, torture, rape and genocide.<br /></p>\n",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "48",
        "rgt": "49",
        "level": "1"
    },
    {
        "id": "81",
        "fieldLayoutId": "2",
        "uid": "79c264ba-b5b9-47bd-b7d6-8668710a0f18",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-08-21 20:33:01",
        "dateUpdated": "2018-08-22 21:51:36",
        "siteSettingsId": "81",
        "slug": "work-related-stress",
        "siteId": "1",
        "uri": "services/work-related-stress",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-08-21 20:33:00",
        "expiryDate": null,
        "contentId": "48",
        "title": "Work Related Stress",
        "field_additionalInformation": null,
        "field_body": "<p><strong>Recognising work related stress:</strong></p>\n<ul><li>Stress is always accompanied by a change in the way we breathe. We take shorter breaths and breathe more quickly. This increases our heart rate, which in turn raises our blood pressure.</li><li>Our energy shifts upward and we live in our heads, disconnected from the earth and unaware of what is happening in or bodies.</li><li>Responding to the message ‘we are under attack’, the subsystems of our body step into action and we begin to produce two of the leading stress hormones adrenalin and cortisol.</li><li>We experience tension in our minds and bodies and lose concentration. We focus on the past and future and develop knots in our shoulders, tension headaches and pain in our neck and lower back. Operating on automatic pilot, we taste, hear, see, smell and feel less.</li><li>In relationships we react by withdrawing and not speaking our truth or getting angry and saying things we don’t really mean. We feel less connected to ourselves, and the world around us</li><li>Our immunity decreases and we fall sick more easily. Every aspect of our wellbeing falls out of synch.</li></ul><p><strong>How can counselling help?</strong></p>\n<p>Counselling with the therapists at Castle Counselling Services can provide you with the space to consider what stressors you are experiencing through work, and how you can learn to minimise these in your day to day work. We can also provide you with support in terms of relaxation techniques and also allow you to consider the issue(s) in cognitive terms through the lens of CBT. We can also assist you in making practical steps to assist in your recovery including consideration of self care and practical ways to manage your stress better.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>\"The adverse reaction people have to excessive pressures or other types of demand placed on them at work.\"<br /></p>\n<p>Stress is not an illness – it is a state. However, if stress becomes too excessive and prolonged, mental and physical illness may develop.</p>\n<p>Pressure can be positive and a motivating factor, and is often essential in a job. It can help us achieve our goals and perform better. Stress occurs when this pressure becomes excessive. Stress is a natural reaction to too much pressure.<br /></p>\n",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "50",
        "rgt": "51",
        "level": "1"
    },
    {
        "id": "90",
        "fieldLayoutId": "2",
        "uid": "08072c27-07de-4a70-8ebb-83bd1754ae90",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-09-04 21:38:01",
        "dateUpdated": "2018-09-04 21:38:01",
        "siteSettingsId": "90",
        "slug": "abortion",
        "siteId": "1",
        "uri": "services/abortion",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-09-04 21:38:00",
        "expiryDate": null,
        "contentId": "56",
        "title": "Abortion",
        "field_additionalInformation": null,
        "field_body": "<p>Counselling after an abortion provides a safe space to talk through the different emotions you may be feeling. Therapies like Cognitive Behavioural Therapy can be helpful in coping with unhelpful thoughts and behaviours. It can help you learn relaxation techniques, emotional regulation and coping strategies whilst you’re struggling.</p>\n<p>The decision to end a pregnancy is rarely easy, but there is help available. Life throws us many curve balls and sometimes we need a hand catching them, so never be afraid to reach out for support.</p>\n<p>As counsellors we can help you to explore what it meant to you and provide a full confidential service</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>If you have had an abortion you may find you want to talk to someone who can help you work through your feelings. Sometimes people experience feelings of guilt and depression and talking to someone can really help, whether your abortion was last week or many years ago.<br /></p>\n",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "52",
        "rgt": "53",
        "level": "1"
    },
    {
        "id": "92",
        "fieldLayoutId": "2",
        "uid": "fbe29d6f-7526-466a-a4d6-a809d24831ea",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-09-04 21:38:51",
        "dateUpdated": "2018-09-04 21:38:51",
        "siteSettingsId": "92",
        "slug": "abuse",
        "siteId": "1",
        "uri": "services/abuse",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-09-04 21:38:00",
        "expiryDate": null,
        "contentId": "57",
        "title": "Abuse",
        "field_additionalInformation": null,
        "field_body": "<h2>Recognising signs of abuse:</h2>\n<p>Is your relationship abusive? Symptoms of an abusive relationship may include one or more of the following:</p>\n<ul><li>physical violence including suicide threats</li><li>isolation which begins by monopolising the partner’s attention</li><li>gradual ‘falling out’ with partner’s support network</li><li>jealousy - asking a partner to prove their loyalty</li><li>controlling behaviour – controlling a partner’s friends and activities</li><li>constant criticism and put-downs</li><li>one person’s needs dismissed or minimised</li><li>secrecy.</li></ul><p>Individual counselling may benefit the victim. This can help them detach themselves from the partner’s behaviour.</p>\n<p>Counselling can help restore self-esteem and re-examine healthy ways of relating.</p>\n<p>Issues in ending an abusive relationship.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>There are many different types of abuse. While the more common forms include domestic violence, child abuse and emotional abuse, any behaviour towards someone that causes deliberate harm or upset can be considered abuse.<br /></p>\n",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "54",
        "rgt": "55",
        "level": "1"
    },
    {
        "id": "94",
        "fieldLayoutId": "2",
        "uid": "51063eff-88c0-4123-b88f-f701de2f9501",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-09-04 21:39:23",
        "dateUpdated": "2018-09-04 21:39:42",
        "siteSettingsId": "94",
        "slug": "addictions",
        "siteId": "1",
        "uri": "services/addictions",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-09-04 21:39:00",
        "expiryDate": null,
        "contentId": "58",
        "title": "Addictions",
        "field_additionalInformation": null,
        "field_body": "<p>The first step in seeking help for addiction is usually to speak to someone about how you are feeling. If you are nervous about speaking to a loved-one, there are various charitable organisations that have been set up to help people with addictions. You may also want to consider visiting your GP who can answer any questions you may have about your condition. Most medical professionals should be comfortable dealing with people with addictions, and will be able to provide a safe and non-prejudiced environment for you and/or your loved ones to express concerns.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Common addictions that people can develop include: <strong>Alcohol, Drugs, Food, Gambling, Sex, Internet, Smoking, Solvent abuse</strong></p>\n<p>In many cases people who are addicted are not aware of their addiction and the impact it may be having on their work, relationships and health. As a result many are unable to quit on their own and treatment is required. Addiction treatment such as counselling is crucial for helping sufferers to recognise their condition and how their emotional needs are affecting their behaviour. This can be an important step on the road to recovery and, eventually abstinence. <br /></p>",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "56",
        "rgt": "57",
        "level": "1"
    },
    {
        "id": "96",
        "fieldLayoutId": "2",
        "uid": "c1b6cfe5-79ce-4a4d-a4ed-c1ab933a1f33",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-09-04 21:40:31",
        "dateUpdated": "2018-09-04 21:40:31",
        "siteSettingsId": "96",
        "slug": "affairs-and-betrayal",
        "siteId": "1",
        "uri": "services/affairs-and-betrayal",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-09-04 21:40:00",
        "expiryDate": null,
        "contentId": "59",
        "title": "Affairs and Betrayal",
        "field_additionalInformation": null,
        "field_body": "<p>Therefore, relationship counselling provides a framework which the individuals begin to work through the trust issues, the betrayal, and the hurt that they are feeling.</p>\n<p>As explained above, relationship counselling can address many aspects of an affair or betrayal, and the impact it can have on a relationship and the individuals involved. It is an important means of helping people to accept and understand a betrayal, whilst guiding them through a process of healing and growth that involves strengthening bonds, rebuilding misplaced trust and learning to communicate better.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>The break of trust for individuals whether it may be an affair, financial, gambling, even drug/alcohol abuse, can affect your health and well-being, and quality of life for the people involved. These affairs and betrayals can dramatically strain a relationship. There may have been many reasons as to why this betrayal has occurred. Some people many choose to end their relationship in particular after finding out about an affair and then there can be a number of people who will want to work things out. Betrayal can damage the foundations of a relationship, as well as trust and communication with one another. <br /></p>\n",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "58",
        "rgt": "59",
        "level": "1"
    },
    {
        "id": "98",
        "fieldLayoutId": "2",
        "uid": "6735d1da-d2a1-46c4-a644-fb50ecc3424d",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-09-04 21:42:09",
        "dateUpdated": "2018-09-04 21:42:09",
        "siteSettingsId": "98",
        "slug": "alcoholism",
        "siteId": "1",
        "uri": "services/alcoholism",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-09-04 21:42:00",
        "expiryDate": null,
        "contentId": "60",
        "title": "Alcoholism",
        "field_additionalInformation": null,
        "field_body": "<p>Addiction is enormously controlling. It can control a person's thoughts and determine their actions. It can take over a personality and change the direction of a person's life and this can be very distressing for partners, spouses, children, friends and family members.</p>\n<p>To take the first step towards recovering from alcohol dependence and for someone to admit they have a problem is very brave. Someone with an addiction can convince themselves that they haven’t a problem but unfortunately these patterns of thought can be unhealthy and that person may be more likely to inflict damage to themselves or others.</p>\n<p>Using various counselling theories for alcoholism treatment can be effective. Looking at the person’s thinking and behaviour in an attempt to crack their emotional or psychological habits.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Alcoholism is a form of alcohol abuse. This refers to a pattern of drinking that is considered to have an increased or high risk - meaning it is very likely to cause harm to your health. </p>\n<p>Alcoholism is thought to increase the risk of Depression, Dementia, Hallucinations, Personality breakdown, Memory loss, Blackouts, Mood swings, Decreased sex drive and Suicidal thoughts.<br /></p>\n",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "60",
        "rgt": "61",
        "level": "1"
    },
    {
        "id": "100",
        "fieldLayoutId": "2",
        "uid": "ae57647a-c501-498b-9d78-3a8a572b3b7b",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-09-04 21:42:47",
        "dateUpdated": "2018-09-04 21:42:47",
        "siteSettingsId": "100",
        "slug": "anger-management",
        "siteId": "1",
        "uri": "services/anger-management",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-09-04 21:42:00",
        "expiryDate": null,
        "contentId": "61",
        "title": "Anger Management",
        "field_additionalInformation": null,
        "field_body": "<p>Fundamentally, anger becomes a problem when it starts to negatively affect you and those around you. While this will depend on how you’re expressing your anger, if you’re keeping it to yourself or expelling it at inappropriate times, you are at risk of damaging not only to your health and well-being but also your relationships - as well as other aspects of your daily life.</p>\n<p>Seeing a counsellor for anger management, you’ll work with the counsellor to learn specific skills and thought processes, tailored to your needs. Anger management therapy tends to include at-home tasks such as journal writing, and various exercises that help you develop the techniques learnt in the session.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Anger is a normal, healthy emotion; however, it can become a problem if you begin to find it difficult to keep under control and it starts to negatively affect you and possible people around you. Keeping anger to yourself and not expressing it can risk or damage not only your health but also your relationships. <br /></p>\n",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "62",
        "rgt": "63",
        "level": "1"
    },
    {
        "id": "102",
        "fieldLayoutId": "2",
        "uid": "16f1f0e7-c63f-48b2-8a84-62b6af011b0b",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-09-04 21:47:32",
        "dateUpdated": "2018-09-04 21:47:32",
        "siteSettingsId": "102",
        "slug": "anorexia-nervosa",
        "siteId": "1",
        "uri": "services/anorexia-nervosa",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-09-04 21:47:00",
        "expiryDate": null,
        "contentId": "62",
        "title": "Anorexia Nervosa",
        "field_additionalInformation": null,
        "field_body": "<p>Some eating problems such as Anorexia and Bulimia are looked upon as a mental health conditions that may need professional help to diagnose and also treat. Some signs of unhealthy eating are:-, Losing appetite, Eating when not hungry, Obsessing about your body image, e.g. I’m too fat, Fear of gaining weight, Being sick, Being secretive about food and Dramatic weight loss or gain.</p>\n<p>Taking the first step to talk to someone is good. Sometimes it may be hard for someone to think that they really have an eating problem, but beginning to talk to someone is the start of your road to recovery. Always remember you are not alone and it is really important to take that first step to recovery.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Eating problems are common and can affect people of any body shape, age or their lifestyle. It can be triggered by a number of things and you can also develop an eating problem if other parts of your life aren’t quite right. <br /></p>\n",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "64",
        "rgt": "65",
        "level": "1"
    },
    {
        "id": "104",
        "fieldLayoutId": "2",
        "uid": "e3a2efaa-b996-480c-8e1c-2becdcc1679a",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-09-04 21:48:22",
        "dateUpdated": "2018-09-04 21:48:22",
        "siteSettingsId": "104",
        "slug": "anxiety",
        "siteId": "1",
        "uri": "services/anxiety",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-09-04 21:48:00",
        "expiryDate": null,
        "contentId": "63",
        "title": "Anxiety",
        "field_additionalInformation": null,
        "field_body": "<p>Anxiety treatment aims to reduce symptoms and teach you coping methods - so that you can manage feelings before they become too severe.</p>\n<h2>Anxiety symptoms</h2>\n<p>While feeling anxious is a natural response, suffering from anxiety long-term can be very intense. Anxiety will affect individuals differently, however, there are common symptoms:- Rapid and/or irregular heartbeat, Fast breathing, Sweating, Nausea, Dizziness, Trouble sleeping, Feeling irritable, Lack of concentration, Panic Attacks.</p>\n<p>Counselling for anxiety is one form of treatment. Talking to a counsellor can help in many ways, including helping you understand what may be causing your anxiety, and teaching you coping techniques. There are many types of talking therapies available, though the most commonly prescribed is cognitive behavioural therapy (CBT).</p>\n<p>Cognitive Behavioural Therapy looks to help you manage problems by enabling you to recognise how your thoughts affect both your feeling and behaviour. CBT combines two approaches; examining your thoughts and the way you behave. This helps to break any overwhelming problems down into smaller, more manageable tasks.</p>\n<p> Mindfulness exercises for anxiety can help you manage symptoms. The aim of mindfulness is to develop your awareness of the present moment. It can teach you to be more appreciative, self-compassionate and non-judgemental. Mindfulness can help you gain greater clarity on your surroundings, which can help you recognise what triggers your anxiety and how to deal with them effectively.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>We will all feel anxious at some time and it’s very common to feel tense or unsure about a potentially stressful situation, such as an exam, starting a new job, or moving home. However, some of us will be affected more than others. Despite being a normal experience, if these feelings are very strong or are lasting a long time, it can be overwhelming.</p>\n<p>Anxiety can make you imagine things are worse than they are and prevent you from carrying out everyday tasks, or even leaving the house. <br /></p>\n",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "66",
        "rgt": "67",
        "level": "1"
    },
    {
        "id": "106",
        "fieldLayoutId": "2",
        "uid": "bbe97e30-d11e-4aea-ab28-fed9b23c7a93",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-09-04 21:49:08",
        "dateUpdated": "2018-09-04 21:49:08",
        "siteSettingsId": "106",
        "slug": "attachment-disorder",
        "siteId": "1",
        "uri": "services/attachment-disorder",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-09-04 21:49:00",
        "expiryDate": null,
        "contentId": "64",
        "title": "Attachment Disorder",
        "field_additionalInformation": null,
        "field_body": "<p>Attachment disorder is typically thought to be specific to children and young people. There is, however, a growing understanding that unresolved attachment issues can cause significant problems in adulthood.</p>\n<p>When attachment issues aren’t addressed during childhood, adults can be left with resulting struggles. Forming relationships and bonds with others is often the biggest issue.</p>\n<p>Adults with attachment disorder may become co-dependant or, alternatively, exert a level of hostility that prevents others from getting close. Others may struggle to tune into their emotions. Many will rely on the coping mechanisms they built during childhood, which can leave them isolated as adults.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Like many mental health concerns, attachment problems fall on a spectrum. Some are mild cases that can be more easily addressed, while others may become an attachment disorder.</p>\n<p>Parenting a child with attachment disorder is a challenging experience. Of course, providing safety for the child and the rest of the family will be a priority. Families will need ongoing support and education to help overcome challenges with attachment.<br /></p>\n",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "68",
        "rgt": "69",
        "level": "1"
    },
    {
        "id": "108",
        "fieldLayoutId": "2",
        "uid": "bba51035-036a-47b2-acf2-b3ea4b100660",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-09-04 21:50:08",
        "dateUpdated": "2018-09-04 21:50:08",
        "siteSettingsId": "108",
        "slug": "bereavement",
        "siteId": "1",
        "uri": "services/bereavement",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-09-04 21:50:00",
        "expiryDate": null,
        "contentId": "65",
        "title": "Bereavement",
        "field_additionalInformation": null,
        "field_body": "<p>Bereavement counselling can provide support during these very difficult times. Talking about the loss often allows a person to adjust to their new life good and bad. Keeping things bottled up or denying the sadness could prolong the pain. Any loss has to be acknowledged for us to move forward. Bereavement counselling tries to help people find a place for their loss so they can carry on with life and eventually find acceptance. Bereavement is about trying to accept what happened, learning to adjust to life without that person and finding a place to keep their memory alive while you try to get along as best you can.</p>\n<p>The bereavement period can be a confusing time involving a lot of powerful emotions. These emotions can grow, fade and shift as we move across the different stages of bereavement. Not everyone experiences the same stages of bereavement at the same time or in the same order, though most people generally go through the following four stages at some point:</p>\n<ul><li>accepting that your loss really happened</li><li>experiencing the pain that comes with grief</li><li>trying to adjust to life without the person who died</li><li>putting less emotional energy into your grief and finding a new place to put it so you can move on</li></ul>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>When someone you care about suddenly leaves your life, it's not a case of taking time out to recover. Grief, although normal, can manifest in unexpected ways. Some people get angry, some people withdraw into themselves and some people become completely numb. Sometimes, grief can trigger mental health conditions, like depression.<br /></p>\n",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "70",
        "rgt": "71",
        "level": "1"
    },
    {
        "id": "110",
        "fieldLayoutId": "2",
        "uid": "d8e30380-6e55-4ee8-b588-2f99f875b977",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-09-04 21:50:56",
        "dateUpdated": "2018-09-04 21:50:56",
        "siteSettingsId": "110",
        "slug": "bipolar-disorder",
        "siteId": "1",
        "uri": "services/bipolar-disorder",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-09-04 21:50:00",
        "expiryDate": null,
        "contentId": "66",
        "title": "Bipolar Disorder",
        "field_additionalInformation": null,
        "field_body": "<p>Everyone’s symptoms are different but by educating oneself to be able to distinguish between the characteristic behaviours and non-characteristic behaviours associated with Bipolar you may be able to become aware of them from an early stage.</p>\n<p>Working with a counsellor can help people with bipolar disorder to better understand the nature of their illness and recognise the triggers of the depressive episodes. Cognitive Behavioural Therapy (CBT) is designed to help individuals change negative thought patterns and learn new coping skills.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Bipolar disorder has been diagnosed as a mental health condition and involves dramatic shifts in mood, energy, behaviour and thinking. People with bipolar disorder will experience contrasting episodes of intense highs and low.</p>\n<p>Bipolar disorder can be unpredictable in nature. It can surface in the form of regular ups and downs throughout a person's life. <br /></p>\n",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "72",
        "rgt": "73",
        "level": "1"
    },
    {
        "id": "112",
        "fieldLayoutId": "2",
        "uid": "67e30629-b5d9-49a2-969a-f90959f4b708",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-09-05 19:37:28",
        "dateUpdated": "2018-09-05 19:37:28",
        "siteSettingsId": "112",
        "slug": "body-dysmorphic-disorder",
        "siteId": "1",
        "uri": "services/body-dysmorphic-disorder",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-09-05 19:37:00",
        "expiryDate": null,
        "contentId": "67",
        "title": "Body Dysmorphic Disorder",
        "field_additionalInformation": null,
        "field_body": "<p>BDD may also cause other problems i.e., feelings of shame, guilt and the person may become lonely, isolating yourself and avoiding people and situations which can lead to severe anxiety or depression, the misuse of alcohol or drugs, self harm, suicidal thoughts and eating disorders. Some people may feel it is necessary to have cosmetic surgery.</p>\n<p>As a form of therapy with the counsellor it is important that the individual seeks support and understanding and build a therapeutic and supportive relationship with the counsellor and themselves. As a counsellor it is important to reassure the person of confidential and a safe environment to discuss and express their concerns about BDD. The person will be show how to develop their own positive thinking patterns so that their behaviour patterns may be altered and controlled when required.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Body Dysmorphic Disorder (BDD) is an anxiety disorder that is related to a person’s body image. People with BDD see themselves differently to how others see them. Being diagnosed with BDD can cause emotional distress and can impact on your ability to carry on with day-to-day life. For some, concerns around appearances may make it difficult to go out in the public and see other people. <br /></p>\n",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "74",
        "rgt": "75",
        "level": "1"
    },
    {
        "id": "114",
        "fieldLayoutId": "2",
        "uid": "75ee5703-888d-4dc1-9355-2dbfcce5ba62",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-09-05 19:38:05",
        "dateUpdated": "2018-09-05 19:38:05",
        "siteSettingsId": "114",
        "slug": "bulimia-nervosa",
        "siteId": "1",
        "uri": "services/bulimia-nervosa",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-09-05 19:38:00",
        "expiryDate": null,
        "contentId": "68",
        "title": "Bulimia Nervosa",
        "field_additionalInformation": null,
        "field_body": "<p>Some symptoms of bulimia may be:</p>\n<ul><li>Eating very large amounts of food sometimes in an out of control way e.g. known as binge eating.</li><li>Making yourself vomit, using laxatives, doing an extreme amount of exercise after the bing in order to avoid putting weight on e.g. called purging.</li><li>Being critical about your body and about weight.</li><li>Feelings of anxiety, and feeling tense.</li></ul><p>Some of these symptoms may not be easy to identify in someone as some people can be very secretive. As with most eating disorders, these can often develop because there may be an underlying issue with the person. Understanding this and receiving help to change these unhelpful thoughts and feelings will be key to overcoming and recovering from this eating disorder.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Bulimia Nervosa is an eating disorder which is regarded as periods of binging, or excessive overeating. People with bulimia have a fear of gaining weight but does not mean that some people with bulimia are underweight. <br /></p>\n",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "76",
        "rgt": "77",
        "level": "1"
    },
    {
        "id": "116",
        "fieldLayoutId": "2",
        "uid": "1a56553b-7557-4b1a-a1ff-c3d7ef3f7261",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-09-05 19:38:37",
        "dateUpdated": "2018-09-05 19:38:37",
        "siteSettingsId": "116",
        "slug": "bullying",
        "siteId": "1",
        "uri": "services/bullying",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-09-05 19:38:00",
        "expiryDate": null,
        "contentId": "69",
        "title": "Bullying",
        "field_additionalInformation": null,
        "field_body": "<p>Bullying can take many forms including:</p>\n<ul><li>physical assault</li><li>teasing</li><li>making threats</li><li>name calling</li><li>cyber bullying</li></ul><p>Bullying can happen anywhere: at school, travelling to and from school, in sports teams, between neighbours or in the workplace. Bullying is very upsetting for people and some feel they can’t cope. If this becomes the case, speak with someone you trust and feel you can speak to for advice.</p>\n<p>Counselling therefore helps the person understand what is happening and how to cope. Looking at assertiveness techniques in teaching the client how to confidently express their rights in an open and honest way and also using CBT allowing the person to alter their thought pattern.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>We often think that bullying is something that just happens in our youth, during our school days and maybe in the playground. Unfortunately bullying is far more common than we may think. Bullying can occur at any age and can be everywhere. It could happen during any time of our life e.g. at school, at work, online, at home and many more. <br /></p>\n",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "78",
        "rgt": "79",
        "level": "1"
    },
    {
        "id": "118",
        "fieldLayoutId": "2",
        "uid": "49ae93ec-6256-4f78-9449-6507206fb98e",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-09-05 19:39:15",
        "dateUpdated": "2018-10-02 17:14:56",
        "siteSettingsId": "118",
        "slug": "cancer",
        "siteId": "1",
        "uri": "services/cancer",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-09-05 19:39:00",
        "expiryDate": null,
        "contentId": "70",
        "title": "Cancer",
        "field_additionalInformation": null,
        "field_body": "<p>Coming to terms with your cancer diagnosis can leave you with feelings of anxiety, stress and your anger levels become heightened as the idea of possibly being in a life threatening situation can be very difficult to cope with. Some people therefore don’t want to burden their family and friends with their fears. </p>\n\n<p>Coming to talk with a counsellor and empathetic professional can be somewhat of a relief for the person when their everyday life’s and relationships feel like they have been turned upside down. Having that support from the counsellor helps you and your family manage and navigate your and their emotions and fears that you may be experiencing. Although counselling will not cure cancer, it can help provide the person with better coping strategies, and support you during and after your treatment and help with any mental health issues that may arise.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>If you, a loved one, family member or friend has been given a diagnosis of cancer, the cancer diagnoses can be very difficult and painful. Feelings, of shock, grief, death and fear are just some of the emotions that people may deal with. Some people fear the effects of the disease, the treatment they may have to receive, the impact it may have on loved ones and what the future will hold.</p>",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "80",
        "rgt": "81",
        "level": "1"
    },
    {
        "id": "120",
        "fieldLayoutId": "2",
        "uid": "2cb25139-950f-4273-bd5a-b7ae5a889f1d",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-09-05 19:39:45",
        "dateUpdated": "2018-09-05 19:39:45",
        "siteSettingsId": "120",
        "slug": "carer-support",
        "siteId": "1",
        "uri": "services/carer-support",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-09-05 19:39:00",
        "expiryDate": null,
        "contentId": "71",
        "title": "Carer Support",
        "field_additionalInformation": null,
        "field_body": "<p>For some, caring becomes a sudden. For others relatives begin to age and are unable to cope, or your partner's health deteriorates. </p>\n\n<p>The responsibilities carers have will depend on the illness of the person they care for. Generally, carers will look to help loved ones in their everyday activities. This can range from feeding and clothing someone, to taking them out and socialising.</p>\n<p>People undertaking a caring role can benefit from counselling in particular if you feel the impacts of caring are affecting your mental or physical health. As a caregiver, a huge amount of time is spent on others. This allows you little time to focus on themselves therefore attending counselling sessions can help with this.</p>\n<p>Attending counselling offers you an opportunity to talk about your thoughts and feelings in a safe, confidential environment. It allows you the time and space to think about your needs. This can help you make sense of your emotions and develop coping mechanisms for issues that cannot be resolved.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Carer’s are people who help other people in their day-to-day life. Unlike people who provide care professionally, most of these carers are friends or relatives of the person they are caring for.<br /></p><p>Providing this support is essential for helping loved ones, but understandably it can be mentally and physically exhausting</p>\n",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "82",
        "rgt": "83",
        "level": "1"
    },
    {
        "id": "122",
        "fieldLayoutId": "2",
        "uid": "c0f03d94-06ea-425e-9119-d8a10123eafa",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-09-05 19:40:24",
        "dateUpdated": "2018-10-02 21:25:26",
        "siteSettingsId": "122",
        "slug": "child-related-issues",
        "siteId": "1",
        "uri": "services/child-related-issues",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-09-05 19:40:00",
        "expiryDate": null,
        "contentId": "72",
        "title": "Child Related Issues",
        "field_additionalInformation": null,
        "field_body": "<p>Children and young people can benefit from counselling in a number of areas, including:</p>\n<ul><li>Learning and motivation problems</li><li>Family relationships and family breakdown</li><li>Bullying</li><li>Behavioural issues</li><li>Anxiety, phobias or low self-esteem</li><li>Eating disorders or self harm.</li><li>Depression</li><li>Trauma and PTSD</li><li>Bereavement and grief</li></ul>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Children or young people may experience difficulties dealing with their behaviour, feelings or emotions. Counselling can provide children and their families with help and support to understand what lies behind that behaviour, feelings and emotions and to help them find a way forward. Counselling may take place between the child and the counsellor, where there is a broader family issue to explore and address, or the child’s problems relate in part to their relationships with other family members.<br /></p>",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "84",
        "rgt": "85",
        "level": "1"
    },
    {
        "id": "124",
        "fieldLayoutId": "2",
        "uid": "67eda621-3bb3-4c40-9104-c318237a6fce",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-09-05 19:41:31",
        "dateUpdated": "2018-09-05 19:41:31",
        "siteSettingsId": "124",
        "slug": "chronic-fatigue-or-me-syndrome",
        "siteId": "1",
        "uri": "services/chronic-fatigue-or-me-syndrome",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-09-05 19:41:00",
        "expiryDate": null,
        "contentId": "73",
        "title": "Chronic Fatigue or ME Syndrome",
        "field_additionalInformation": null,
        "field_body": "<p>CFS syndrome can affect anyone at any stage in their life, but it is more commonly found in woman. Symptoms may vary from person to person e.g. a general lack of well-being along with tiredness, irritability, sensitivity, poor concentration and sleep disturbance. Some of the most common symptoms of CFS are listed below:-</p>\n<ul><li>General feeling of discomfort</li><li>Tiredness which is not relieved by any amount of sleep</li><li>Sleeping problems such as insomnia or un-refreshing sleep</li><li>Memory problems – difficulty concentrating</li><li>Sore throat</li><li>Enlarged lymph nodes in neck or armpits</li><li>Unexplained muscle pain</li><li>Irritability</li><li>Severe headaches</li><li>Stomach problems such as nausea, bloating, diarrhoea and constipation</li><li>Sensitivity to light and noise</li><li>Extreme exhaustion lasting more than 24 hours after mental or physical exercise</li></ul><p>Counselling can help you cope with the physical symptoms and negotiate the psychological and emotion impact of CFS.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Chronic Fatigue Syndrome (CFS) is also commonly known as ME is a condition that causes extreme tiredness. The exhaustion that people can experience can limit their ability to carry out normal day to day activities and leave people with symptoms of anxiety, stress or depression. <br /></p>\n",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "86",
        "rgt": "87",
        "level": "1"
    },
    {
        "id": "126",
        "fieldLayoutId": "2",
        "uid": "cb8529e0-7aa5-4e16-878e-9a543de4830d",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-09-05 19:41:49",
        "dateUpdated": "2018-09-05 19:41:49",
        "siteSettingsId": "126",
        "slug": "dementia",
        "siteId": "1",
        "uri": "services/dementia",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-09-05 19:41:00",
        "expiryDate": null,
        "contentId": "74",
        "title": "Dementia",
        "field_additionalInformation": null,
        "field_body": "<p>Many carers can feel guilty for seeking support, and guilt is such a destructive emotion, therefore counselling can give much-needed dementia support by providing people with the opportunity to speak in confidence about the issues that might be troubling them.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Counselling can help by providing support for people living with dementia (and their families), as well as helping them discover ways of coping in the longer term. Carers of people living with dementia can experience a high level of stress and anxiety and can have a detrimental effect upon a person’s well-being. <br /></p>\n",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "88",
        "rgt": "89",
        "level": "1"
    },
    {
        "id": "128",
        "fieldLayoutId": "2",
        "uid": "1a01d949-a287-4775-a11c-05475396f686",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-09-05 19:43:00",
        "dateUpdated": "2018-09-05 19:43:00",
        "siteSettingsId": "128",
        "slug": "depression",
        "siteId": "1",
        "uri": "services/depression",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-09-05 19:43:00",
        "expiryDate": null,
        "contentId": "75",
        "title": "Depression",
        "field_additionalInformation": null,
        "field_body": "<p>Sometimes it’s instantly apparent what the cause is, but other times there isn’t an obvious reason why you feel so down. It could be that you’ve lost something or someone through bereavement. Usually there will be more than one reason why you suffer from depression, and these reasons differ from person to person.</p>\n<p>Common reasons behind the development of depression include:</p>\n<ul><li><strong>Distressing life events</strong> - Distressing life events can take their toll on us. Divorce, family problems or losing a job are all momentous in our lives that can alter our mood.</li><li><strong>Bereavement</strong> -Losing someone that is close to you, even from natural causes, can increase the risk. It’s not always just the loss that causes it, it’s the way we deal with it. If you don’t grieve or express your feelings properly, they can build up and contribute towards depression.</li><li><strong>Childhood experiences</strong> - Your childhood experiences can affect you in adult life. If you were physically or emotionally abused, or not taught to cope with troubles that enter your life, it could lead you to having problems as you grow up.</li><li><strong>Anger</strong> - ‘Frozen anger’ is a term that’s closely related to depression. You may have gone through something that caused you to become angry, but at the time you couldn’t express your feelings properly. This type of anger becomes suppressed; it can then build up and become a cause of depression.</li></ul>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Living with depression can be difficult, not only for sufferers, but also for those around them and therefore some people will wait a long time before seeking help. This is especially true if they fear it will make them feel rejected, ridiculed or deprived of a sense of control. <br /></p>\n",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "90",
        "rgt": "91",
        "level": "1"
    },
    {
        "id": "130",
        "fieldLayoutId": "2",
        "uid": "9927bafd-55d8-451f-9be9-e3de2b4216e8",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-09-05 19:43:19",
        "dateUpdated": "2018-09-05 19:43:19",
        "siteSettingsId": "130",
        "slug": "disabilities",
        "siteId": "1",
        "uri": "services/disabilities",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-09-05 19:43:00",
        "expiryDate": null,
        "contentId": "76",
        "title": "Disabilities",
        "field_additionalInformation": null,
        "field_body": "<p>It can often lead to low social support and financial hardship. These experiences can then be linked to mental health problems, such as depression and anxiety. Counselling can help to address these issues, as well as helping you cope better with the disability and adapting to the changes it brings. The aim of disability counselling is to provide a safe and supportive space for you to discuss your concerns and fears. A trusted professional will be there to help you explore ways of making these more manageable.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Living with a disability can be a long journey, both mentally and physically. It can be just as tough for those who live with, or care for a disabled person. Friends and family may too find it difficult to come to terms with the condition, as well as adapting to a lifestyle that involves new challenges. You may find disability counselling beneficial if you are suddenly classed as disabled as a result of an accident. Similarly, if you have a serious health condition, such as cancer, it can provide some of the support you may need.<br /></p>\n",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "92",
        "rgt": "93",
        "level": "1"
    },
    {
        "id": "132",
        "fieldLayoutId": "2",
        "uid": "24c0632e-d398-4e9b-92f4-df8478b00042",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-09-05 19:43:58",
        "dateUpdated": "2018-09-05 19:43:58",
        "siteSettingsId": "132",
        "slug": "dissociation",
        "siteId": "1",
        "uri": "services/dissociation",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-09-05 19:43:00",
        "expiryDate": null,
        "contentId": "77",
        "title": "Dissociation",
        "field_additionalInformation": null,
        "field_body": "<p>The effects of dissociation and dissociative disorders can be difficult to pinpoint and differ from person to person. The following symptoms are examples of what you may experience:</p>\n<ul><li>feeling detached from your body</li><li>experiencing gaps in your memory</li><li>forgetting important information about yourself</li><li>feeling as if there is more than one person inside of you</li><li>hearing voices</li><li>feeling as if the world around you isn't real</li><li>referring to yourself as 'we' rather than 'I'</li><li>having out-of-body experiences</li><li>other people telling you that you have behaved out of character</li><li>feeling detached from your emotions</li><li>feeling numb or devoid of emotion.</li></ul><p>A person who has a dissociative disorder may also be experiencing other problems too such as anxiety, depression, suicidal thoughts, panic attacks, hearing voices, phobias, obsessive behaviours and more. Through counselling treating dissociative disorders aims to re-connect you with your thoughts, feeling and memories to help you feel more real and complete as a person.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>All of us have times when we feel 'disconnected'. It could be that we are having a conversation with someone but our mind is elsewhere, or we arrive at a destination with no recollection of driving there. For most of us, these moments are occasional lapses that bear no impact on our daily lives.<br /></p>\n",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "94",
        "rgt": "95",
        "level": "1"
    },
    {
        "id": "134",
        "fieldLayoutId": "2",
        "uid": "14c4b9f1-9b6d-489b-a8e5-a0892d862430",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-09-05 19:44:14",
        "dateUpdated": "2018-10-02 21:26:41",
        "siteSettingsId": "134",
        "slug": "domestic-violence",
        "siteId": "1",
        "uri": "services/domestic-violence",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-09-05 19:44:00",
        "expiryDate": null,
        "contentId": "78",
        "title": "Domestic Violence",
        "field_additionalInformation": null,
        "field_body": "<p>Abuse can take many different forms and every situation is unique, however, there are some common signs of abuse you may well recognise:</p><ul><li>verbal abuse and criticism (shouting, name-calling, threatening, mocking)</li><li>guilt/pressuring tactics (threatening self-harm or suicide, taking away your phone/laptop, threatening to call the authorities on you, lying to friends and family about you)</li><li>putting you down (disrespecting you in front of others, not listening or responding to you when you talk)</li><li>isolation (monitoring or blocking your connection with others, stopping you from leaving the house, telling you where you can and cannot go)</li><li>lying to you (breaking promises, having affairs, often blaming you)</li><li>threats (physically or verbally threatening you)</li><li>sexual violence (using force, threatening you to perform sexual acts, forcing you to have sex with other people)</li><li>physical violence (hitting, kicking, pushing, restraining you)</li><li>denial (making you think you’re imagining the abuse, saying they can’t control their anger, appearing charming/calm in front of others, begging for forgiveness)</li></ul>\n<p>Statistically, it is more common for women to be affected by domestic violence, but it’s important to note that men can be victims too. The situation is awful for both women and men, however, men may face the additional stigma of not wanting to appear as a ‘victim’ or even worrying that no one will believe them.</p>\n<p>A counsellor can work with you at any stage of your journey, whether you’re out of the relationship or still in it. At Castle Counselling Services, we can work with you to help you recognise signs of abuse and help you understand your own behaviours/way of thinking. We can utilise many different techniques and approaches that may be provide support to you, from assertiveness and grounding techniques to CBT to improve your self-esteem.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Domestic violence can take many forms and can affect anyone, regardless of gender, sexuality, race or age. People who are experiencing or have experienced domestic abuse will need emotional support of some kind, but their needs will vary. People need to be listened to with respect and without being judged when they choose to talk about their experiences.</p>",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "96",
        "rgt": "97",
        "level": "1"
    },
    {
        "id": "136",
        "fieldLayoutId": "2",
        "uid": "20835843-ce96-4597-b790-1b3ad71323b6",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-09-05 19:44:33",
        "dateUpdated": "2018-09-05 19:44:33",
        "siteSettingsId": "136",
        "slug": "drug-abuse",
        "siteId": "1",
        "uri": "services/drug-abuse",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-09-05 19:44:00",
        "expiryDate": null,
        "contentId": "79",
        "title": "Drug Abuse",
        "field_additionalInformation": null,
        "field_body": "<p>Overcoming drug abuse can be very difficult and most people will require help in different forms e.g. form of counselling and self-help groups, although the exact methods used will depend on the individual and the nature of their addiction. Treatment for drug abuse can only be successful if an individual is ready and willing to change. It can take a lot of courage and strength to face up to an addiction, but recognising that you need help is the first important step to a successful recovery. </p>\n<p>Attending counselling and seeing a counsellor can often help people who are addicted set achievable and empowering short-term goals as they work to overcome their addiction. Once sobriety is achieved, adaptive skills can be developed as the person works to regain physical and emotional health, and the counsellor can begin to explore the source or cause of the addiction with the person in treatment as the person begins to employ the new coping strategies. Together, the counsellor and the person being treated can work to set long-term goals that may include rebuilding damaged relationships, accepting responsibility for actions, and releasing guilt.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Drug abuse is an unhealthy dependence on a medication or drug that usually begins with the voluntary taking of drugs. When addiction to drugs habit starts this can cause them and their loved ones serious harm, people with drug addiction cannot control or stop their drug using.<br /></p>\n",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "98",
        "rgt": "99",
        "level": "1"
    },
    {
        "id": "144",
        "fieldLayoutId": "2",
        "uid": "56264277-506b-4fe7-9405-a49dc57e18fd",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-09-18 18:54:39",
        "dateUpdated": "2018-09-18 18:54:39",
        "siteSettingsId": "144",
        "slug": "mental-health",
        "siteId": "1",
        "uri": "services/mental-health",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-09-18 18:54:00",
        "expiryDate": null,
        "contentId": "83",
        "title": "Mental Health",
        "field_additionalInformation": null,
        "field_body": "<p>Mental health issues can have a profound impact on how we think, feel and behave. They can range from the daily worries we all have from time to time, to serious long-term problems that require treatment to manage effectively.</p>\n<p>Mental health issues with neurotic symptoms include:</p>\n<ul><li>depression</li><li>anxiety</li><li>obsessive compulsive disorder (OCD)</li><li>phobias</li><li>post-traumatic stress disorder (PTSD)</li><li>panic disorders.</li></ul><p>Mental health issues with psychotic symptoms include:</p>\n<ul><li>schizophrenia</li><li>eating disorders</li><li>substance abuse</li><li>bipolar disorder</li><li>personality disorder.</li></ul><p>Often people have to learn to live with their problems. They may find everyday situations such as work and socialising particularly difficult.</p>\n<p>Some of the challenges faced include:</p>\n<ul><li>social stigma</li><li>going to work</li><li>going to school</li><li>relationships</li><li>parenting</li><li>physical health</li></ul>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Mental health is a broad topic and is a key part of our overall well-being. Mental health refers to the way in which we are aware of our own abilities and can cope relatively well with the ups and downs of life. </p>\n<p>Talking therapies such as counselling are considered effective forms of mental health support. <br /></p>\n",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "100",
        "rgt": "101",
        "level": "1"
    },
    {
        "id": "167",
        "fieldLayoutId": "2",
        "uid": "71a62ede-4c34-41d4-bc57-a50e8c18b1b4",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-10-02 17:07:57",
        "dateUpdated": "2018-10-02 17:07:57",
        "siteSettingsId": "167",
        "slug": "suicidal-ideation",
        "siteId": "1",
        "uri": "services/suicidal-ideation",
        "enabledForSite": "1",
        "sectionId": "2",
        "typeId": "2",
        "authorId": "1",
        "postDate": "2018-10-02 17:07:00",
        "expiryDate": null,
        "contentId": "98",
        "title": "Suicidal Ideation",
        "field_additionalInformation": null,
        "field_body": "<p>These thoughts can be extremely scary, overwhelming and confusing for you, but there is support that you can access.</p>\n<p>If you feel that you need immediate help and cannot keep yourself safe you need to:</p><ul><li>Go to your nearest A&amp;E</li><li>Call 999</li><li>Ask someone else to take you to A&amp;E or call 999</li><li>Talk to Lifeline on 0808 800 8000 (24 hrs helpline)</li><li>Talk to Samaritans on 116 123 (24 hrs helpline)</li></ul>\n<p>You can also speak to your GP, or if it is out of hours contact Dalriada Doctor on Call on (028) 2566 3500.</p>\n<p>If you feel comfortable you could also confide in a friend or family member.</p>\n<p>If you are experiencing suicidal thoughts you may experience:</p><ul><li>Feelings of overwhelm and fear</li><li>You may feel unwanted/un-needed by others</li><li>Hopeless</li><li>You may that loved ones would be better off without you</li><li>You may feel physically numb</li></ul>\n<p>You may also experience:</p>\n<ul><li>Sleep difficulties</li><li>Changes in your appetite</li><li>An urge to self-harm</li><li>Isolate yourself from others</li><li>Lack of self care</li></ul>\n<p>If you are feeling this way, please talk to someone, do not try to manage this on your own. At CCS we can offer you a safe space in which to explore these feelings if you are in crisis. The space is non-judgemental, and we offer you a caring and compassionate space in which it is ok to not always be ok. We can work with you to ensure that you are kept safe by creating a collaborative keep safe plan, and can help you in finding a way forward that works for you. </p>\n<p>If our counsellors feel that there is a risk to you or to others, we do have an ethical requirement to let other professionals aware (GP etc), but this will be done in a very collaborative way by our therapists, and you will be involved at all stages of the onward discussions. </p>\n<p>Our therapists have attended ASIST Suicide Awareness Training, and continue to keep up to date with current research and training.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": null,
        "field_facebook": null,
        "field_introduction": "<p>Suicidal thoughts can occur when you are thinking or feeling that you may want to take your own life. These thoughts and feelings normally span a spectrum, and can present as persistent or fleeting thoughts that others may be better off without you, and you may/or may not begin to formulate a plan to end your life.</p>",
        "field_messenger": null,
        "field_telephoneNumber": null,
        "field_trainingAttended": null,
        "field_trainingInformation": null,
        "root": "9",
        "lft": "102",
        "rgt": "103",
        "level": "1"
    }
]