[
    {
        "id": "28",
        "fieldLayoutId": "14",
        "uid": "260c42dd-caea-49a9-b7d2-560242df8a22",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-08-12 09:38:39",
        "dateUpdated": "2018-12-13 19:57:35",
        "siteSettingsId": "28",
        "slug": "louise-okane",
        "siteId": "1",
        "uri": "therapists/louise-okane",
        "enabledForSite": "1",
        "sectionId": "10",
        "typeId": "10",
        "authorId": "1",
        "postDate": "2018-08-12 09:38:00",
        "photo": "/assets/images/louise-o-kane.jpeg",
        "expiryDate": null,
        "contentId": "20",
        "title": "Louise O'Kane",
        "field_additionalInformation": null,
        "field_body": "<p>My name is Louise and I am a fully qualified professional integrative counsellor. My therapy base is located in The Loft, Ballycastle, which is easily accessible in the causeway coast and glens area by car and public transport. I can offer you a gentle, compassionate, confidential and non-judgmental space, where you can just be you, and can explore how you would like to make changes within your life, and how you may move forward. </p><p>I began on this journey seven years ago, when I experienced depression and anxiety, and found counselling offered me the space I needed to make sense of what was happening to me, and to make my way towards recovery, and I hope that as a client I can offer you the same experience. I am fully qualified after completing a three year degree in counselling, and continue to attend training on a regular basis to provide you with a first class professional service. I am very passionate about my work, and about the changes that can be brought about by counselling. </p>\n<p>By working as an integrative counsellor I have access to a number of different theories and concepts which can be used depending on your individual needs, including Cognitive Behavioural Therapy. I also employ creative techniques and can offer guidance on mindfulness exercises, which can be very useful for clients with anxiety. </p>\n<p>For me the most important thing is building a strong therapeutic relationship with you, and our work will be very much led by you, we will journey at your pace, and focus on issues which are most important to you. </p>\n<p>I can offer you immediate appointments, and can offer sessions in the early morning, daytime, evening and weekends, depending on when works best for you. </p>\n<p>When we are facing difficulties, it can be a big decision to ask for help, but by making that first initial step you have already begun your journey to recovery. I will be there with you from our first contact, to your first appointment and will remain with you therapeutically for the time that you need.</p>\n<p>I have significant experience of counselling adults and young people, and have also attended training to assist me in working with younger children through the medium of play therapy. I have experience of counselling in a community organisation and health centre, and have extensive experience of working with depression, anxiety, bereavement, relationship issues, family issues, low self esteem, self-harm and thoughts of suicide. </p>\n<p>When you make contact you will deal directly with me, and I can be contacted by phone or e-mail, and we will arrange an appointment which suits you. There are limited waiting times, so you can be seen when you need it most.</p>\n<p>Professionally I am an individual member of the British Association of Counsellors and Psychotherapy, and am an accredited member the National Counselling Service, and work fully to their ethical codes of practice. </p>\n<p>I also have a vast amount of experience working in the NHS, which has been particularly useful when providing clients with information about services in the local area.</p>\n<p>If you are thinking about making the decision to come for counselling, please be assured that I can offer you a safe space to consider what is happening in your life, and can walk each step with you on your journey to recovery.</p>\n<p>I look forward to connecting with you.</p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": "louise.counsellingservices@gmail.com",
        "field_facebook": null,
        "field_introduction": null,
        "field_messenger": null,
        "field_telephoneNumber": "07715926144",
        "field_trainingAttended": ["ASSIST Suicide Awareness training","Rainbow LGBT Training","Wave Trauma Training","Northern Recovery College WRAP training","AWARE Mental Health First Aid Training","Psychology of Eating Training – Life Therapies","Sensorimotor Training (trauma related)","Assessment Training – A safe space to be","Child Protection Training","Accredited Introduction to Play Therapy – Play Therapy UK","Enhanced Access NI Police Check","Mental Health First Aid","Creative Techniques for working with Children"],
        "field_trainingInformation": "",
        "root": "16",
        "lft": "2",
        "rgt": "3",
        "level": "1"
    },
    {
        "id": "30",
        "fieldLayoutId": "14",
        "uid": "175ae69c-9541-4661-80d1-725d47570feb",
        "enabled": "1",
        "archived": "0",
        "dateCreated": "2018-08-12 09:39:21",
        "dateUpdated": "2018-09-05 21:00:14",
        "siteSettingsId": "30",
        "slug": "monica-oneill",
        "siteId": "1",
        "uri": "therapists/monica-oneill",
        "enabledForSite": "1",
        "sectionId": "10",
        "typeId": "10",
        "authorId": "1",
        "postDate": "2018-08-12 09:39:00",
        "photo": "/assets/images/monica-o-neil.jpeg",
        "expiryDate": null,
        "contentId": "22",
        "title": "Monica O'Neill",
        "field_additionalInformation": null,
        "field_body": "<p>I am a professional, qualified, integrative counsellor providing a counselling service and I am based in the Ballycastle, North Antrim and Causeway Coast area. I am passionate about counselling and the benefits which can be obtained from it. I am not a fan of jargon and technical terms, I feel they only confuse and create misunderstanding. I prefer to be real, genuine and understandable. <br /><br />In 2007 my life was turned upside down through a trauma and as I tried to make sense of the changes now in my life, and find solutions for myself and my children, I felt counselling made me feel supported, pro-active and empowered. <br /><br />As a result from this I re-trained as a counsellor in order to help and empower others. I offer one to one sessions addressing a variety of issues and problems, providing a confidential, comfortable, safe place for you to reflect and concentrate on yourself and your life experiences without judgement or pressure. I use elements from Person Centred, CBT and Psychodynamic counselling approaches to tailor each session to meet your individual need.<br /><br />I encourage you to move at your own pace and direct the sessions in the direction you feel most comfortable. I feel at the heart of successful therapy is the relationship between the client and counsellor<br /><br />I offer a counselling experience in a safe, confidential space, during weekdays and also can facilitate evening and weekend appointments. I offer immediate appointments. I can offer you the support and opportunity you need to identify, explore and reflect on the issues that cause you pain and distress. <br /><br />I am a member of the BACP and UCS and adhere to their guidelines regarding my practice and ethics.</p>\n<p>When you call to arrange an appointment you will speak directly to me, we can arrange a time and place which is suitable to you. <br /></p>\n<p>I have experience working with teenagers in a Secondary School setting and I have also worked in a Health Centre seeing a diverse range of clients with a wide range of issues and situations.</p>\n<p>I deal a lot with relationship issues, depression, anxiety, and bereavement and unhelp patterns of behaviour.<br /></p>",
        "field_costPerHour": null,
        "field_deactivate": null,
        "field_emailAddress": "monica@castlecounsellingservices.com",
        "field_facebook": null,
        "field_introduction": null,
        "field_messenger": null,
        "field_telephoneNumber": "07513216489",
        "field_trainingAttended": ["Enhanced Access NI police check","Certificate in Counselling Skills","ASIST suicide training Suicide Awareness & Prevention","Wrap Training (Wellness Recovery Action Programme)","First Aid","Mental Health Training","FdSc in Counselling","BACP member","USC member","University of Ulster Foundation Degree in Counselling (Commendation)","BACP Certificate of Proficiency","Safeguarding: Child Protection & Vulnerable Adults Oct 2015","Working with children","Lifeline Training","Wave Training"],
        "field_trainingInformation": null,
        "root": "16",
        "lft": "4",
        "rgt": "5",
        "level": "1"
    }
]